[Survived] Block removal mutation
Core/Commons/Paging/Order.cs:12:5
     public string Property { get; init; }
 
     public Order(Direction direction, string property)
-    {
-        Direction = direction;
-        Property = property;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
