[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQuery.cs:31:9
         Location = location;
         Prices = prices;
         Status = status?.Trim().ToUpperInvariant();
-        Validator.ValidateAndThrow(this);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
