[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryAdvertise.cs:13:23
 
     public SearchPropertiesQueryAdvertise(string transaction)
     {
-        Transaction = transaction == null ? "NONE" : transaction.ToUpperInvariant();
+        Transaction = transaction != null ? "NONE" : transaction.ToUpperInvariant();
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
