[Killed] Null coalescing mutation (remove right)
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:180:31
 
     public SearchPropertiesQuery Build()
     {
-        string propertyType = _type ?? "All";
+        string propertyType = "All";
 
         SearchPropertiesQueryAdvertise queryAdvertise = new SearchPropertiesQueryAdvertise(_transaction);
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (left to right)
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:180:31
 
     public SearchPropertiesQuery Build()
     {
-        string propertyType = _type ?? "All";
+        string propertyType = "All" ?? _type;
 
         SearchPropertiesQueryAdvertise queryAdvertise = new SearchPropertiesQueryAdvertise(_transaction);
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Object initializer mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:194:51
             BuiltArea = Range<int>.Of(_fromBuiltArea, _toBuiltArea)
         };
 
-        SearchPropertiesQueryPrices queryPrices = new SearchPropertiesQueryPrices
-        {
-            SellingPrice = Range<double>.Of(_fromSellingPrice, _toSellingPrice),
-            RentalTotalPrice = Range<double>.Of(_fromRentalTotalPrice, _toRentalTotalPrice),
-            RentalPrice = Range<double>.Of(_fromRentalPrice, _toRentalPrice),
-            PriceByM2 = Range<double>.Of(_fromPriceByM2, _toPriceByM2)
-        };
+        SearchPropertiesQueryPrices queryPrices = new SearchPropertiesQueryPrices
+{};
 
         string status = _status ?? "NONE";
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (left to right)
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:202:25
             PriceByM2 = Range<double>.Of(_fromPriceByM2, _toPriceByM2)
         };
 
-        string status = _status ?? "NONE";
+        string status = "NONE" ?? _status;
 
         return new SearchPropertiesQuery(
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (remove right)
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:202:25
             PriceByM2 = Range<double>.Of(_fromPriceByM2, _toPriceByM2)
         };
 
-        string status = _status ?? "NONE";
+        string status = "NONE";
 
         return new SearchPropertiesQuery(
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
