[Killed] Null coalescing mutation (left to right)
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:17:17
 
     public SearchPropertiesQueryLocation(string state, string city, List<string> districts)
     {
-        State = state ?? string.Empty;
+        State = string.Empty ?? state;
         City = city ?? string.Empty;
         Districts = districts ?? new List<string>();
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (remove right)
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:17:17
 
     public SearchPropertiesQueryLocation(string state, string city, List<string> districts)
     {
-        State = state ?? string.Empty;
+        State = string.Empty;
         City = city ?? string.Empty;
         Districts = districts ?? new List<string>();
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (remove right)
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:18:16
     public SearchPropertiesQueryLocation(string state, string city, List<string> districts)
     {
         State = state ?? string.Empty;
-        City = city ?? string.Empty;
+        City = string.Empty;
         Districts = districts ?? new List<string>();
     }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (left to right)
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:18:16
     public SearchPropertiesQueryLocation(string state, string city, List<string> districts)
     {
         State = state ?? string.Empty;
-        City = city ?? string.Empty;
+        City = string.Empty ?? city;
         Districts = districts ?? new List<string>();
     }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (remove right)
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:19:21
     {
         State = state ?? string.Empty;
         City = city ?? string.Empty;
-        Districts = districts ?? new List<string>();
+        Districts = new List<string>();
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Null coalescing mutation (left to right)
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:19:21
     {
         State = state ?? string.Empty;
         City = city ?? string.Empty;
-        Districts = districts ?? new List<string>();
+        Districts = new List<string>() ?? districts;
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
