[Killed] String mutation
properties-api-netcore/Core/Commons/ArgumentChecker.cs:19:16
 
     public static bool IsLong(string input)
     {
-        return string.IsNullOrEmpty(input) || long.TryParse(input, out _);
+        return (input!="") || long.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong

[Killed] Equality mutation
properties-api-netcore/Core/Commons/ArgumentChecker.cs:25:20
     public static bool IsValidUri(string link)
     {
         return Uri.TryCreate(link, UriKind.Absolute, out Uri outUri)
-               && (outUri.Scheme == Uri.UriSchemeHttp || outUri.Scheme == Uri.UriSchemeHttps);
+               && (outUri.Scheme != Uri.UriSchemeHttp || outUri.Scheme == Uri.UriSchemeHttps);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl

[Killed] Logical mutation
properties-api-netcore/Core/Commons/ArgumentChecker.cs:68:20
         {
             JSchema schema = JSchema.Parse(input);
 
-            return schema.Properties.Count > 0 && schema.Required.Count > 0 && schema.Type.HasValue;
+            return schema.Properties.Count > 0 && schema.Required.Count > 0 || schema.Type.HasValue;
         }
         catch (Exception)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields
