[Killed] Equality mutation
properties-api-netcore/Core/Commons/ArgumentValidator.cs:21:34
 
     public static IReadOnlyCollection<T> CheckNullOrEmpty<T>(IReadOnlyCollection<T> input, string parameterName, string message = null)
     {
-        if (input is not null && input.Count > 0) return input;
+        if (input is not null && input.Count < 0) return input;
 
         if (input is null) throw CreateArgumentNullException(parameterName, message);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateAnObjectListParameterIfItIsNotNull; UnitTest.Core.Commons.Paging.PageRequestTest.SuccessfulToInstantiatePageRequestIfParametersAreValid

[Killed] Equality mutation
properties-api-netcore/Core/Commons/ArgumentValidator.cs:21:34
 
     public static IReadOnlyCollection<T> CheckNullOrEmpty<T>(IReadOnlyCollection<T> input, string parameterName, string message = null)
     {
-        if (input is not null && input.Count > 0) return input;
+        if (input is not null && input.Count >= 0) return input;
 
         if (input is null) throw CreateArgumentNullException(parameterName, message);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmptyWithCustomMessage

[Killed] Equality mutation
properties-api-netcore/Core/Commons/ArgumentValidator.cs:30:13
 
     public static void CheckNegative(int input, string parameterName, string message)
     {
-        if (input >= 0) return;
+        if (input < 0) return;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters

[Killed] String mutation
properties-api-netcore/Core/Commons/ArgumentValidator.cs:31:67
     public static void CheckNegative(int input, string parameterName, string message)
     {
         if (input >= 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = string.IsNullOrEmpty(message) ? $"" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters

[Killed] Equality mutation
properties-api-netcore/Core/Commons/ArgumentValidator.cs:37:13
 
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
-        if (input > 0) return;
+        if (input < 0) return;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameterWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameterWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter
