[Killed] Object initializer mutation
properties-api-netcore/Core/Commons/JsonSchemaValidator.cs:41:20
         (
             from keyValuePair in jSchema.Properties
             where !jObject.ContainsKey(keyValuePair.Key)
-            select new FieldError
-            {
-                PropertyName = keyValuePair.Key,
-                ErrorMessage = "CommonJsonPropertyMissing"
-            }
+            select new FieldError
+{}
         ).ToList();
     }
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] String mutation
properties-api-netcore/Core/Commons/JsonSchemaValidator.cs:58:32
             {
                 PropertyName = property.Name,
                 AttemptedValue = property.Value.ToString(),
-                ErrorMessage = "CommonJsonPropertyInvalid"
+                ErrorMessage = ""
             }
         ).ToList();
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] String mutation
properties-api-netcore/Core/Commons/JsonSchemaValidator.cs:88:30
         }
         catch (Exception)
         {
-            attemptedValue = "An invalid value";
+            attemptedValue = "";
         }
 
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType
