[Killed] String mutation
Domains/Properties/Models/PropertyStatus.cs:7:71
 
 public sealed class PropertyStatus : Enumeration<PropertyStatus>
 {
-    public static readonly PropertyStatus All = new PropertyStatus(0, "ALL");
+    public static readonly PropertyStatus All = new PropertyStatus(0, "");
     public static readonly PropertyStatus Active = new PropertyStatus(1, "ACTIVE");
     public static readonly PropertyStatus Inactive = new PropertyStatus(2, "INACTIVE");
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
