[Killed] String mutation
Domains/Properties/Models/Transaction.cs:7:65
 
 public sealed class Transaction : Enumeration<Transaction>
 {
-    public static readonly Transaction All = new Transaction(0, "ALL");
+    public static readonly Transaction All = new Transaction(0, "");
     public static readonly Transaction Sale = new Transaction(1, "SALE");
     public static readonly Transaction Rent = new Transaction(2, "RENT");
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
