[Killed] Statement mutation
Domains/Properties/Query/GetPropertyByIdQuery.cs:17:9
     public GetPropertyByIdQuery(string id)
     {
         Id = id;
-        Validator.ValidateAndThrow(this);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.GetPropertyByIdQueryTest.FailToGetPropertyByIdWithNullOrEmptyId
