[Killed] Statement mutation
Domains/Properties/Query/GetPropertyByIdQueryValidator.cs:9:9
 {
     public GetPropertyByIdQueryValidator()
     {
-        RuleFor(query => query.Id)
-            .Cascade(CascadeMode.Stop)
-            .NotNull()
-            .WithMessage("ValidationPropertyIdIsNullOrEmpty");
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.GetPropertyByIdQueryTest.FailToGetPropertyByIdWithNullOrEmptyId

[Killed] String mutation
Domains/Properties/Query/GetPropertyByIdQueryValidator.cs:12:26
         RuleFor(query => query.Id)
             .Cascade(CascadeMode.Stop)
             .NotNull()
-            .WithMessage("ValidationPropertyIdIsNullOrEmpty");
+            .WithMessage("");
     }
 }
killedBy: UnitTest.Core.Domains.Properties.UseCases.GetPropertyByIdUseCaseTest.FailToGetPropertyWhenPropertyNotFound; UnitTest.Core.Domains.Properties.UseCases.GetPropertyByIdUseCaseTest.SuccessfullyGetPropertyWhenPropertyFound
