[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQuery.cs:31:9
         Attributes = attributes;
         Location = location;
         Prices = prices;
-        Validator.ValidateAndThrow(this);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
