[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryAdvertise.cs:12:5
     public string Transaction { get; init; }
 
     protected internal SearchPropertiesQueryAdvertise(string transaction)
-    {
-        Transaction = transaction;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
