[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryAttributes.cs:22:5
         Range<byte> numberOfGarages,
         Range<int> area,
         Range<int> builtArea)
-    {
-        NumberOfBedrooms = numberOfBedrooms;
-        NumberOfToilets = numberOfToilets;
-        NumberOfGarages = numberOfGarages;
-        Area = area;
-        BuiltArea = builtArea;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
