[Survived] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBase.cs:9:5
     public string Status { get; init; }
 
     protected SearchPropertiesQueryBase(string type, string status)
-    {
-        Type = type;
-        Status = status;
-    }
+    {}
 }
