[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:35:5
     private List<string> _districts = new List<string>();
 
     public SearchPropertiesQueryBuilder WithType(string type)
-    {
-        _type = type;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithTransaction(string transaction)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:41:5
     }
 
     public SearchPropertiesQueryBuilder WithTransaction(string transaction)
-    {
-        _transaction = transaction;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromNumberOfBedrooms(byte fromNumberOfBedrooms)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:47:5
     }
 
     public SearchPropertiesQueryBuilder WithFromNumberOfBedrooms(byte fromNumberOfBedrooms)
-    {
-        _fromNumberOfBedrooms = fromNumberOfBedrooms;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToNumberOfBedrooms(byte toNumberOfBedrooms)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:53:5
     }
 
     public SearchPropertiesQueryBuilder WithToNumberOfBedrooms(byte toNumberOfBedrooms)
-    {
-        _toNumberOfBedrooms = toNumberOfBedrooms;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromNumberOfToilets(byte fromNumberOfToilets)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:59:5
     }
 
     public SearchPropertiesQueryBuilder WithFromNumberOfToilets(byte fromNumberOfToilets)
-    {
-        _fromNumberOfToilets = fromNumberOfToilets;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToNumberOfToilets(byte toNumberOfToilets)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:65:5
     }
 
     public SearchPropertiesQueryBuilder WithToNumberOfToilets(byte toNumberOfToilets)
-    {
-        _toNumberOfToilets = toNumberOfToilets;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromNumberOfGarages(byte fromNumberOfGarages)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:71:5
     }
 
     public SearchPropertiesQueryBuilder WithFromNumberOfGarages(byte fromNumberOfGarages)
-    {
-        _fromNumberOfGarages = fromNumberOfGarages;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToNumberOfGarages(byte toNumberOfGarages)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:77:5
     }
 
     public SearchPropertiesQueryBuilder WithToNumberOfGarages(byte toNumberOfGarages)
-    {
-        _toNumberOfGarages = toNumberOfGarages;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithCity(string city)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:83:5
     }
 
     public SearchPropertiesQueryBuilder WithCity(string city)
-    {
-        _city = city;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithState(string state)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:89:5
     }
 
     public SearchPropertiesQueryBuilder WithState(string state)
-    {
-        _state = state;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithDistricts(List<string> districts)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:95:5
     }
 
     public SearchPropertiesQueryBuilder WithDistricts(List<string> districts)
-    {
-        _districts = districts;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromArea(int fromArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:101:5
     }
 
     public SearchPropertiesQueryBuilder WithFromArea(int fromArea)
-    {
-        _fromArea = fromArea;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToArea(int toArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:107:5
     }
 
     public SearchPropertiesQueryBuilder WithToArea(int toArea)
-    {
-        _toArea = toArea;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromBuiltArea(int fromBuiltArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:113:5
     }
 
     public SearchPropertiesQueryBuilder WithFromBuiltArea(int fromBuiltArea)
-    {
-        _fromBuiltArea = fromBuiltArea;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToBuiltArea(int toBuiltArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:119:5
     }
 
     public SearchPropertiesQueryBuilder WithToBuiltArea(int toBuiltArea)
-    {
-        _toBuiltArea = toBuiltArea;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromSellingPrice(double fromSellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:125:5
     }
 
     public SearchPropertiesQueryBuilder WithFromSellingPrice(double fromSellingPrice)
-    {
-        _fromSellingPrice = fromSellingPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToSellingPrice(double toSellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:131:5
     }
 
     public SearchPropertiesQueryBuilder WithToSellingPrice(double toSellingPrice)
-    {
-        _toSellingPrice = toSellingPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromRentalTotalPrice(double fromRentalTotalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:137:5
     }
 
     public SearchPropertiesQueryBuilder WithFromRentalTotalPrice(double fromRentalTotalPrice)
-    {
-        _fromRentalTotalPrice = fromRentalTotalPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToRentalTotalPrice(double toRentalTotalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:143:5
     }
 
     public SearchPropertiesQueryBuilder WithToRentalTotalPrice(double toRentalTotalPrice)
-    {
-        _toRentalTotalPrice = toRentalTotalPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromRentalPrice(double fromRentalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:149:5
     }
 
     public SearchPropertiesQueryBuilder WithFromRentalPrice(double fromRentalPrice)
-    {
-        _fromRentalPrice = fromRentalPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToRentalPrice(double toRentalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:155:5
     }
 
     public SearchPropertiesQueryBuilder WithToRentalPrice(double toRentalPrice)
-    {
-        _toRentalPrice = toRentalPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromPriceByM2(double fromPriceByM2)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:161:5
     }
 
     public SearchPropertiesQueryBuilder WithFromPriceByM2(double fromPriceByM2)
-    {
-        _fromPriceByM2 = fromPriceByM2;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToPriceByM2(double toPriceByM2)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:167:5
     }
 
     public SearchPropertiesQueryBuilder WithToPriceByM2(double toPriceByM2)
-    {
-        _toPriceByM2 = toPriceByM2;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithStatus(string status)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:173:5
     }
 
     public SearchPropertiesQueryBuilder WithStatus(string status)
-    {
-        _status = status;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQuery Build()
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Negate expression
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:180:31
 
     public SearchPropertiesQuery Build()
     {
-        string propertyType = string.IsNullOrWhiteSpace(_type) ? "ALL" : _type.ToUpper();
+        string propertyType = !(string.IsNullOrWhiteSpace(_type) ) ? "ALL" : _type.ToUpper();
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
         string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:180:31
 
     public SearchPropertiesQuery Build()
     {
-        string propertyType = string.IsNullOrWhiteSpace(_type) ? "ALL" : _type.ToUpper();
+        string propertyType = (_type!=null) ? "ALL" : _type.ToUpper();
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
         string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Negate expression
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:181:25
     public SearchPropertiesQuery Build()
     {
         string propertyType = string.IsNullOrWhiteSpace(_type) ? "ALL" : _type.ToUpper();
-        string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
+        string status = !(string.IsNullOrWhiteSpace(_status) ) ? "ALL" : _status.ToUpper();
         string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:181:25
     public SearchPropertiesQuery Build()
     {
         string propertyType = string.IsNullOrWhiteSpace(_type) ? "ALL" : _type.ToUpper();
-        string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
+        string status = (_status!=null) ? "ALL" : _status.ToUpper();
         string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Negate expression
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:182:30
     {
         string propertyType = string.IsNullOrWhiteSpace(_type) ? "ALL" : _type.ToUpper();
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
-        string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
+        string transaction = !(string.IsNullOrWhiteSpace(_transaction) ) ? "ALL" : _transaction.ToUpper();
 
         SearchPropertiesQueryAdvertise queryAdvertise = new SearchPropertiesQueryAdvertise(transaction);
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:182:30
     {
         string propertyType = string.IsNullOrWhiteSpace(_type) ? "ALL" : _type.ToUpper();
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
-        string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
+        string transaction = (_transaction!="") ? "ALL" : _transaction.ToUpper();
 
         SearchPropertiesQueryAdvertise queryAdvertise = new SearchPropertiesQueryAdvertise(transaction);
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
