[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryLocation.cs:16:5
     public List<string> Districts { get; init; }
 
     protected internal SearchPropertiesQueryLocation(string state, string city, List<string> districts)
-    {
-        State = state;
-        City = city;
-        Districts = districts;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
