[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryPrices.cs:20:5
         Range<double> rentalTotalPrice,
         Range<double> rentalPrice,
         Range<double> priceByM2)
-    {
-        SellingPrice = sellingPrice;
-        RentalTotalPrice = rentalTotalPrice;
-        RentalPrice = rentalPrice;
-        PriceByM2 = priceByM2;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
