[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:11:9
 {
     public SearchPropertiesQueryValidator()
     {
-        RuleFor(query => query.Type)
-            .Cascade(CascadeMode.Stop)
-            .Must(ArgumentChecker.IsValidEnumOf<PropertyType>)
-            .WithMessage("ValidationPropertyTypeIsInvalid");
+        ;
 
         RuleFor(query => query.Advertise.Transaction)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:14:26
         RuleFor(query => query.Type)
             .Cascade(CascadeMode.Stop)
             .Must(ArgumentChecker.IsValidEnumOf<PropertyType>)
-            .WithMessage("ValidationPropertyTypeIsInvalid");
+            .WithMessage("");
 
         RuleFor(query => query.Advertise.Transaction)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:16:9
             .Must(ArgumentChecker.IsValidEnumOf<PropertyType>)
             .WithMessage("ValidationPropertyTypeIsInvalid");
 
-        RuleFor(query => query.Advertise.Transaction)
-            .Cascade(CascadeMode.Stop)
-            .Must(ArgumentChecker.IsValidEnumOf<Transaction>)
-            .WithMessage("ValidationPropertyTransactionIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.NumberOfBedrooms)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:21:9
             .Must(ArgumentChecker.IsValidEnumOf<Transaction>)
             .WithMessage("ValidationPropertyTransactionIsInvalid");
 
-        RuleFor(query => query.Attributes.NumberOfBedrooms)
-            .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To)
-            .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.NumberOfToilets)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:23:39
 
         RuleFor(query => query.Attributes.NumberOfBedrooms)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To)
+            .Must(numberOfBedrooms => numberOfBedrooms.From < numberOfBedrooms.To)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:23:39
 
         RuleFor(query => query.Attributes.NumberOfBedrooms)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To)
+            .Must(numberOfBedrooms => numberOfBedrooms.From > numberOfBedrooms.To)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:26:9
             .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
-        RuleFor(query => query.Attributes.NumberOfToilets)
-            .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To)
-            .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.NumberOfGarages)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:28:38
 
         RuleFor(query => query.Attributes.NumberOfToilets)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To)
+            .Must(numberOfToilets => numberOfToilets.From < numberOfToilets.To)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:28:38
 
         RuleFor(query => query.Attributes.NumberOfToilets)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To)
+            .Must(numberOfToilets => numberOfToilets.From > numberOfToilets.To)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:29:26
         RuleFor(query => query.Attributes.NumberOfToilets)
             .Cascade(CascadeMode.Stop)
             .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To)
-            .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
+            .WithMessage("");
 
         RuleFor(query => query.Attributes.NumberOfGarages)
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:31:9
             .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
-        RuleFor(query => query.Attributes.NumberOfGarages)
-            .Cascade(CascadeMode.Stop)
-            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To)
-            .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.Area)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:33:38
 
         RuleFor(query => query.Attributes.NumberOfGarages)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To)
+            .Must(numberOfGarages => numberOfGarages.From > numberOfGarages.To)
             .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:33:38
 
         RuleFor(query => query.Attributes.NumberOfGarages)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To)
+            .Must(numberOfGarages => numberOfGarages.From < numberOfGarages.To)
             .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:34:26
         RuleFor(query => query.Attributes.NumberOfGarages)
             .Cascade(CascadeMode.Stop)
             .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To)
-            .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
+            .WithMessage("");
 
         RuleFor(query => query.Attributes.Area)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:36:9
             .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To)
             .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
 
-        RuleFor(query => query.Attributes.Area)
-            .Cascade(CascadeMode.Stop)
-            .Must(area => area.From <= area.To)
-            .WithMessage("ValidationPropertyAreaIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.BuiltArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:38:27
 
         RuleFor(query => query.Attributes.Area)
             .Cascade(CascadeMode.Stop)
-            .Must(area => area.From <= area.To)
+            .Must(area => area.From < area.To)
             .WithMessage("ValidationPropertyAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:38:27
 
         RuleFor(query => query.Attributes.Area)
             .Cascade(CascadeMode.Stop)
-            .Must(area => area.From <= area.To)
+            .Must(area => area.From > area.To)
             .WithMessage("ValidationPropertyAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:41:9
             .Must(area => area.From <= area.To)
             .WithMessage("ValidationPropertyAreaIsInvalid");
 
-        RuleFor(query => query.Attributes.BuiltArea)
-            .Cascade(CascadeMode.Stop)
-            .Must(builtArea => builtArea.From <= builtArea.To)
-            .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
+        ;
 
         RuleFor(query => query.Prices.SellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:43:32
 
         RuleFor(query => query.Attributes.BuiltArea)
             .Cascade(CascadeMode.Stop)
-            .Must(builtArea => builtArea.From <= builtArea.To)
+            .Must(builtArea => builtArea.From < builtArea.To)
             .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:43:32
 
         RuleFor(query => query.Attributes.BuiltArea)
             .Cascade(CascadeMode.Stop)
-            .Must(builtArea => builtArea.From <= builtArea.To)
+            .Must(builtArea => builtArea.From > builtArea.To)
             .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:44:26
         RuleFor(query => query.Attributes.BuiltArea)
             .Cascade(CascadeMode.Stop)
             .Must(builtArea => builtArea.From <= builtArea.To)
-            .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
+            .WithMessage("");
 
         RuleFor(query => query.Prices.SellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:46:9
             .Must(builtArea => builtArea.From <= builtArea.To)
             .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
 
-        RuleFor(query => query.Prices.SellingPrice)
-            .Cascade(CascadeMode.Stop)
-            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To)
-            .WithMessage("ValidationPropertySellingPriceIsInvalid");
+        ;
         
         RuleFor(query => query.Prices.RentalTotalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:48:35
 
         RuleFor(query => query.Prices.SellingPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To)
+            .Must(sellingPrice => sellingPrice.From > sellingPrice.To)
             .WithMessage("ValidationPropertySellingPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:48:35
 
         RuleFor(query => query.Prices.SellingPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To)
+            .Must(sellingPrice => sellingPrice.From < sellingPrice.To)
             .WithMessage("ValidationPropertySellingPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:51:9
             .Must(sellingPrice => sellingPrice.From <= sellingPrice.To)
             .WithMessage("ValidationPropertySellingPriceIsInvalid");
         
-        RuleFor(query => query.Prices.RentalTotalPrice)
-            .Cascade(CascadeMode.Stop)
-            .Must(rentalTotalPrice => rentalTotalPrice.From <= rentalTotalPrice.To)
-            .WithMessage("ValidationPropertyRentalTotalPriceIsInvalid");
+        ;
         
         RuleFor(query => query.Prices.RentalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:53:39
         
         RuleFor(query => query.Prices.RentalTotalPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(rentalTotalPrice => rentalTotalPrice.From <= rentalTotalPrice.To)
+            .Must(rentalTotalPrice => rentalTotalPrice.From < rentalTotalPrice.To)
             .WithMessage("ValidationPropertyRentalTotalPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:53:39
         
         RuleFor(query => query.Prices.RentalTotalPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(rentalTotalPrice => rentalTotalPrice.From <= rentalTotalPrice.To)
+            .Must(rentalTotalPrice => rentalTotalPrice.From > rentalTotalPrice.To)
             .WithMessage("ValidationPropertyRentalTotalPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:56:9
             .Must(rentalTotalPrice => rentalTotalPrice.From <= rentalTotalPrice.To)
             .WithMessage("ValidationPropertyRentalTotalPriceIsInvalid");
         
-        RuleFor(query => query.Prices.RentalPrice)
-            .Cascade(CascadeMode.Stop)
-            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To)
-            .WithMessage("ValidationPropertyRentalPriceIsInvalid");
+        ;
         
         RuleFor(query => query.Prices.PriceByM2)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:58:34
         
         RuleFor(query => query.Prices.RentalPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To)
+            .Must(rentalPrice => rentalPrice.From > rentalPrice.To)
             .WithMessage("ValidationPropertyRentalPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:58:34
         
         RuleFor(query => query.Prices.RentalPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To)
+            .Must(rentalPrice => rentalPrice.From < rentalPrice.To)
             .WithMessage("ValidationPropertyRentalPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:61:9
             .Must(rentalPrice => rentalPrice.From <= rentalPrice.To)
             .WithMessage("ValidationPropertyRentalPriceIsInvalid");
         
-        RuleFor(query => query.Prices.PriceByM2)
-            .Cascade(CascadeMode.Stop)
-            .Must(priceByM2 => priceByM2.From <= priceByM2.To)
-            .WithMessage("ValidationPropertyPriceByM2IsInvalid");
+        ;
         
         RuleFor(query => query.Status)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:63:32
         
         RuleFor(query => query.Prices.PriceByM2)
             .Cascade(CascadeMode.Stop)
-            .Must(priceByM2 => priceByM2.From <= priceByM2.To)
+            .Must(priceByM2 => priceByM2.From < priceByM2.To)
             .WithMessage("ValidationPropertyPriceByM2IsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:63:32
         
         RuleFor(query => query.Prices.PriceByM2)
             .Cascade(CascadeMode.Stop)
-            .Must(priceByM2 => priceByM2.From <= priceByM2.To)
+            .Must(priceByM2 => priceByM2.From > priceByM2.To)
             .WithMessage("ValidationPropertyPriceByM2IsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:66:9
             .Must(priceByM2 => priceByM2.From <= priceByM2.To)
             .WithMessage("ValidationPropertyPriceByM2IsInvalid");
         
-        RuleFor(query => query.Status)
-            .Cascade(CascadeMode.Stop)
-            .Must(ArgumentChecker.IsValidEnumOf<PropertyStatus>)
-            .WithMessage("ValidationPropertyStatusIsInvalid");
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
