[Killed] Block removal mutation
Domains/Properties/UseCases/GetPropertyByIdUseCase.cs:15:5
     private readonly IGetPropertyByIdGateway _getPropertyByIdGateway;
 
     public GetPropertyByIdUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _getPropertyByIdGateway = serviceResolver.Resolve<IGetPropertyByIdGateway>();
-    }
+    {}
 
     public async Task<Property> ExecuteAsync(GetPropertyByIdQuery query)
killedBy: UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.Properties.UseCases.GetPropertyByIdUseCaseTest.FailToGetPropertyWhenPropertyNotFound; UnitTest.Core.Domains.Properties.UseCases.GetPropertyByIdUseCaseTest.SuccessfullyGetPropertyWhenPropertyFound
