[Killed] Block removal mutation
Domains/Properties/UseCases/SearchPropertiesUseCase.cs:15:5
     private readonly ISearchPropertiesGateway _searchPropertiesGateway;
 
     public SearchPropertiesUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _searchPropertiesGateway = serviceResolver.Resolve<ISearchPropertiesGateway>();
-    }
+    {}
 
     public async Task<Page<Property>> ExecuteAsync(SearchPropertiesQuery query, PageRequest pageRequest)
killedBy: UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters

[Killed] Block removal mutation
Domains/Properties/UseCases/SearchPropertiesUseCase.cs:21:5
     }
 
     public async Task<Page<Property>> ExecuteAsync(SearchPropertiesQuery query, PageRequest pageRequest)
-    {
-        return await _searchPropertiesGateway.ExecuteAsync(query, pageRequest);
-    }
+    {}
 }
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters
