[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:21:72
 
 public sealed class SearchPropertiesController : ISearchPropertiesController
 {
-    private static readonly string[] SortableFields = {"SellingPrice", "RentalTotalPrice", "RentalPrice", "PriceByM2", "CreatedDate", "UpdatedDate"};
+    private static readonly string[] SortableFields = {"SellingPrice", "", "RentalPrice", "PriceByM2", "CreatedDate", "UpdatedDate"};
 
     private readonly IHttpContextAccessor _httpContextAccessor;

[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:21:107
 
 public sealed class SearchPropertiesController : ISearchPropertiesController
 {
-    private static readonly string[] SortableFields = {"SellingPrice", "RentalTotalPrice", "RentalPrice", "PriceByM2", "CreatedDate", "UpdatedDate"};
+    private static readonly string[] SortableFields = {"SellingPrice", "RentalTotalPrice", "RentalPrice", "", "CreatedDate", "UpdatedDate"};
 
     private readonly IHttpContextAccessor _httpContextAccessor;
