[NoCoverage] String mutation
Domains/Properties/EntryPoints/SearchPropertiesPresenter.cs:49:53
             Ranking = property.Ranking,
             Status = property.Status.Name.ToUpperInvariant(),
             // TODO: Double check if the date time zone is correct.
-            CreatedAt = property.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
+            CreatedAt = property.CreatedAt.ToString(""),
             UpdatedAt = property.UpdatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
             Href = $"{baseUrl.AppendIfMissing("/")}{property.Id}"
