[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:63:5
     }
 
     private static ResponseStatus HandleAccessDeniedException(Exception exception)
-    {
-        AccessDeniedException accessDeniedException = (AccessDeniedException) exception;
-        string message = IExceptionHandler.MessageFormatter(accessDeniedException.Message, accessDeniedException.Parameters);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.Forbidden, message);
-    }
+    {}
 
     private static ResponseStatus HandleException()
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException
