[Killed] Equality mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:29:16
 
     private bool Equals(ResponseStatus other)
     {
-        return Code == other.Code &&
+        return Code != other.Code &&
                Message == other.Message
                && Fields.Count == other.Fields.Count
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Survived] Logical mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:29:16
 
     private bool Equals(ResponseStatus other)
     {
-        return Code == other.Code &&
-               Message == other.Message
-               && Fields.Count == other.Fields.Count
+        return Code == other.Code &&
+               Message == other.Message
+               || Fields.Count == other.Fields.Count
                && !Fields.Except(other.Fields).Any() && !other.Fields.Except(Fields).Any();
     }

[Killed] Equality mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:30:16
     private bool Equals(ResponseStatus other)
     {
         return Code == other.Code &&
-               Message == other.Message
+               Message != other.Message
                && Fields.Count == other.Fields.Count
                && !Fields.Except(other.Fields).Any() && !other.Fields.Except(Fields).Any();
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Equality mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:31:19
     {
         return Code == other.Code &&
                Message == other.Message
-               && Fields.Count == other.Fields.Count
+               && Fields.Count != other.Fields.Count
                && !Fields.Except(other.Fields).Any() && !other.Fields.Except(Fields).Any();
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:32:57
         return Code == other.Code &&
                Message == other.Message
                && Fields.Count == other.Fields.Count
-               && !Fields.Except(other.Fields).Any() && !other.Fields.Except(Fields).Any();
+               && !Fields.Except(other.Fields).Any() && other.Fields.Except(Fields).Any();
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:32:19
         return Code == other.Code &&
                Message == other.Message
                && Fields.Count == other.Fields.Count
-               && !Fields.Except(other.Fields).Any() && !other.Fields.Except(Fields).Any();
+               && Fields.Except(other.Fields).Any() && !other.Fields.Except(Fields).Any();
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Logical mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:37:16
 
     public override bool Equals(object obj)
     {
-        return ReferenceEquals(this, obj) || obj is ResponseStatus other && Equals(other);
+        return ReferenceEquals(this, obj) && obj is ResponseStatus other && Equals(other);
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException
