[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/ServiceResolver.cs:11:5
     private IServiceProvider _serviceProvider;
 
     public void Setup(IServiceProvider serviceProvider)
-    {
-        _serviceProvider = serviceProvider;
-    }
+    {}
 
     public T Resolve<T>()
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.FailToResolveService; IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveService

[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/ServiceResolver.cs:16:5
     }
 
     public T Resolve<T>()
-    {
-        Type type = typeof(T);
-        T service = (T) _serviceProvider.GetService(type);
-        return ArgumentValidator.CheckNull(service, nameof(type));
-    }
+    {}
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.FailToResolveService; IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveService
