[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:21:72
 
 public sealed class SearchPropertiesController : ISearchPropertiesController
 {
-    private static readonly string[] SortableFields = {"sellingPrice", "rentalTotalPrice", "rentalPrice", "priceByM2", "createdAt", "updatedAt"};
+    private static readonly string[] SortableFields = {"sellingPrice", "", "rentalPrice", "priceByM2", "createdAt", "updatedAt"};
 
     private readonly IHttpContextAccessor _httpContextAccessor;

[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:21:107
 
 public sealed class SearchPropertiesController : ISearchPropertiesController
 {
-    private static readonly string[] SortableFields = {"sellingPrice", "rentalTotalPrice", "rentalPrice", "priceByM2", "createdAt", "updatedAt"};
+    private static readonly string[] SortableFields = {"sellingPrice", "rentalTotalPrice", "rentalPrice", "", "createdAt", "updatedAt"};
 
     private readonly IHttpContextAccessor _httpContextAccessor;

[NoCoverage] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:44:46
 
         PageableSearchPropertiesResponse response = SearchPropertiesPresenter.Of(page, baseUrl);
 
-        if (page.Pageable.TotalPages == 0 || pageRequest.PageNumber >= page.Pageable.TotalPages)
+        if (page.Pageable.TotalPages == 0 || pageRequest.PageNumber > page.Pageable.TotalPages)
         {
             return await ResponseBuilder.BuildResponse(HttpStatusCode.NoContent);
