[NoCoverage] Block removal mutation
Domains/Properties/EntryPoints/SearchPropertiesPresenter.cs:13:5
 public static class SearchPropertiesPresenter
 {
     public static PageableSearchPropertiesResponse Of(Page<Property> page, string baseUrl)
-    {
-        
-        List<SearchPropertiesInnerResponse> content = page.Content.Select(it => Of(it, baseUrl)).ToList();
-        return new PageableSearchPropertiesResponse(content, page.Pageable);
-    }
+    {}
 
     private static SearchPropertiesInnerResponse Of(Property property, string baseUrl)

[NoCoverage] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesPresenter.cs:21:22
 
     private static SearchPropertiesInnerResponse Of(Property property, string baseUrl)
     {
-        byte limit = property.Advertise.Description.Length > 40 ? (byte) 40 : (byte) property.Advertise.Description.Length;
+        byte limit = property.Advertise.Description.Length >= 40 ? (byte) 40 : (byte) property.Advertise.Description.Length;
         string introduction = $"{property.Advertise.Description[..limit]}".AppendIfMissing("...");
         return new SearchPropertiesInnerResponse

[NoCoverage] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesPresenter.cs:21:22
 
     private static SearchPropertiesInnerResponse Of(Property property, string baseUrl)
     {
-        byte limit = property.Advertise.Description.Length > 40 ? (byte) 40 : (byte) property.Advertise.Description.Length;
+        byte limit = property.Advertise.Description.Length < 40 ? (byte) 40 : (byte) property.Advertise.Description.Length;
         string introduction = $"{property.Advertise.Description[..limit]}".AppendIfMissing("...");
         return new SearchPropertiesInnerResponse

[NoCoverage] String mutation
Domains/Properties/EntryPoints/SearchPropertiesPresenter.cs:53:20
             // TODO: Double check if the date time zone is correct.
             CreatedAt = property.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
             UpdatedAt = property.UpdatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
-            Href = $"{baseUrl.AppendIfMissing("/")}{property.Id}"
+            Href = $""
         };
     }
