[Killed] Arithmetic mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:40:45
 
         long totalOfElements = GetTotalOfElements(aggregation);
 
-        int totalPages = (int) Math.Ceiling((double) totalOfElements / pageSize);
+        int totalPages = (int) Math.Ceiling((double) totalOfElements * pageSize);
 
         IReadOnlyList<TDocument> content = aggregation.FirstOrDefault()!
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
