[Killed] Object initializer mutation
Domains/Properties/Mapper/PropertyMapper.cs:43:33
             Address = propertyEntity.Address
         };
 
-        PropertyPrices prices = new PropertyPrices
-        {
-            SellingPrice = propertyEntity.SellingPrice,
-            RentalTotalPrice = propertyEntity.RentalTotalPrice,
-            RentalPrice = propertyEntity.RentalPrice,
-            Discount = propertyEntity.Discount,
-            CondominiumFee = propertyEntity.CondominiumFee,
-            PriceByM2 = propertyEntity.PriceByM2
-        };
+        PropertyPrices prices = new PropertyPrices
+{};
 
         PropertyStatus status = PropertyStatus.GetByName(propertyEntity.Status).GetValue();
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Object initializer mutation
Domains/Properties/Mapper/PropertyMapper.cs:55:16
 
         PropertyStatus status = PropertyStatus.GetByName(propertyEntity.Status).GetValue();
 
-        return new Property
-        {
-            Id = propertyEntity.Id,
-            Type = type,
-            Advertise = advertise,
-            Attributes = attributes,
-            Location = location,
-            Prices = prices,
-            HashKey = propertyEntity.HashKey,
-            Ranking = (byte) propertyEntity.Ranking,
-            Status = status,
-            CreatedAt = propertyEntity.CreatedAt.ToLocalTime(),
-            UpdatedAt = propertyEntity.UpdatedAt.ToLocalTime()
-        };
+        return new Property
+{};
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
