[Killed] Block removal mutation
Domains/Properties/Providers/GetPropertyByIdProvider.cs:18:5
     private readonly IRepository<PropertyEntity> _repository;
 
     public GetPropertyByIdProvider(IRepository<PropertyEntity> repository)
-    {
-        _repository = repository;
-    }
+    {}
 
     public async Task<Core.Commons.Optional<Property>> ExecuteAsync(GetPropertyByIdQuery query)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.FailToGetPropertyById; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById

[Killed] Block removal mutation
Domains/Properties/Providers/GetPropertyByIdProvider.cs:23:5
     }
 
     public async Task<Core.Commons.Optional<Property>> ExecuteAsync(GetPropertyByIdQuery query)
-    {
-        FilterDefinition<PropertyEntity> filterDefinition = GetFilterDefinition(Convert.ToInt64(query.Id));
-        Core.Commons.Optional<PropertyEntity> optional = await _repository.FindOneAsync(filterDefinition);
-        return optional.Map(PropertyMapper.Map);
-    }
+    {}
 
     private static FilterDefinition<PropertyEntity> GetFilterDefinition(long id)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById

[Killed] Block removal mutation
Domains/Properties/Providers/GetPropertyByIdProvider.cs:30:5
     }
 
     private static FilterDefinition<PropertyEntity> GetFilterDefinition(long id)
-    {
-        return Builders<PropertyEntity>.Filter.Eq(document => document.Id, id);
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.FailToGetPropertyById; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById
