[Killed] Block removal mutation
Domains/Properties/Providers/RegisterPropertyProvider.cs:24:5
         IRepository<PropertyEntity> propertyRepository,
         ISequenceRepository<PropertySequence> propertySequenceRepository
     )
-    {
-        _propertyRepository = ArgumentValidator.CheckNull(propertyRepository, nameof(propertyRepository));
-        _propertySequenceRepository = ArgumentValidator.CheckNull(propertySequenceRepository, nameof(propertySequenceRepository));
-    }
+    {}
 
     public async Task<Property> ExecuteAsync(Property property)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Block removal mutation
Domains/Properties/Providers/RegisterPropertyProvider.cs:41:5
     }
 
     private async Task IncrementId(Entity entity)
-    {
-        FilterDefinition<PropertySequence> filter = Builders<PropertySequence>.Filter.Eq(sequence => sequence.SequenceName, KeyField);
-        PropertySequence propertySequence = await _propertySequenceRepository.GetSequenceAndUpdate(filter);
-        entity.Id = propertySequence.SequenceValue;
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByIdProviderTest.SuccessfulToGetPropertyById; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
