[Killed] Block removal mutation
Domains/Properties/Providers/SearchPropertiesProvider.cs:26:5
     private readonly IRepository<PropertyEntity> _propertyRepository;
 
     public SearchPropertiesProvider(IRepository<PropertyEntity> propertyRepository)
-    {
-        _propertyRepository = ArgumentValidator.CheckNull(propertyRepository, nameof(propertyRepository));
-    }
+    {}
 
     public async Task<Page<Property>> ExecuteAsync(SearchPropertiesQuery query, PageRequest pageRequest)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Block removal mutation
Domains/Properties/Providers/SearchPropertiesProvider.cs:31:5
     }
 
     public async Task<Page<Property>> ExecuteAsync(SearchPropertiesQuery query, PageRequest pageRequest)
-    {
-        FilterDefinition<PropertyEntity> filter = SearchPropertiesFilterBuilder.Build(query);
-        SortDefinition<PropertyEntity> sort = GetSortDefinitions(pageRequest.Sort.GetOrders());
-        Page<PropertyEntity> page = await _propertyRepository.FindAllAsync(filter, sort, pageRequest.PageNumber, pageRequest.PageSize);
-        List<Property> content = page.Content.Select(PropertyMapper.Map).ToList();
-
-        return new Page<Property>(content, page.Pageable);
-    }
+    {}
 
     private static SortDefinition<PropertyEntity> GetSortDefinitions(IEnumerable<Order> originalOrders)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/Properties/Providers/SearchPropertiesProvider.cs:45:13
         IEnumerable<Order> arrayOfOrders = originalOrders.ToArray();
         List<Order> orders = new List<Order>(arrayOfOrders);
 
-        if (!arrayOfOrders.Any())
+        if (arrayOfOrders.Any())
         {
             orders.Insert(0, new Order(Direction.Desc, DefaultSecondarySortField));

[Killed] Statement mutation
Domains/Properties/Providers/SearchPropertiesProvider.cs:47:13
 
         if (!arrayOfOrders.Any())
         {
-            orders.Insert(0, new Order(Direction.Desc, DefaultSecondarySortField));
+            ;
         }
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort

[Survived] Statement mutation
Domains/Properties/Providers/SearchPropertiesProvider.cs:50:9
             orders.Insert(0, new Order(Direction.Desc, DefaultSecondarySortField));
         }
 
-        orders.Insert(0, new Order(Direction.Desc, DefaultPrimarySortField));
+        ;
 
         return SortHelper.GetSortDefinitions<PropertyEntity>(orders);
