[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:17:23
     {
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
-        string type = query.Type.ToUpperInvariant() == NoFilter ? "" : query.Type;
+        string type = query.Type.ToUpperInvariant() != NoFilter ? "" : query.Type;
         string transaction = query.Advertise.Transaction.ToUpperInvariant() == NoFilter ? "" : query.Advertise.Transaction;
         string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildEmptyFilterDefinitionWhenValuesAreNotRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] String mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:17:67
     {
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
-        string type = query.Type.ToUpperInvariant() == NoFilter ? "" : query.Type;
+        string type = query.Type.ToUpperInvariant() == NoFilter ? "Stryker was here!" : query.Type;
         string transaction = query.Advertise.Transaction.ToUpperInvariant() == NoFilter ? "" : query.Advertise.Transaction;
         string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildEmptyFilterDefinitionWhenValuesAreNotRelevant

[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:18:30
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
         string type = query.Type.ToUpperInvariant() == NoFilter ? "" : query.Type;
-        string transaction = query.Advertise.Transaction.ToUpperInvariant() == NoFilter ? "" : query.Advertise.Transaction;
+        string transaction = query.Advertise.Transaction.ToUpperInvariant() != NoFilter ? "" : query.Advertise.Transaction;
         string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildEmptyFilterDefinitionWhenValuesAreNotRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:19:25
 
         string type = query.Type.ToUpperInvariant() == NoFilter ? "" : query.Type;
         string transaction = query.Advertise.Transaction.ToUpperInvariant() == NoFilter ? "" : query.Advertise.Transaction;
-        string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
+        string status = query.Status.ToUpperInvariant() != NoFilter ? "" : query.Status;
 
         FilterHelper.AddEqualsFilter(filters, document => document.Type, type);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildEmptyFilterDefinitionWhenValuesAreNotRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] String mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:19:71
 
         string type = query.Type.ToUpperInvariant() == NoFilter ? "" : query.Type;
         string transaction = query.Advertise.Transaction.ToUpperInvariant() == NoFilter ? "" : query.Advertise.Transaction;
-        string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
+        string status = query.Status.ToUpperInvariant() == NoFilter ? "Stryker was here!" : query.Status;
 
         FilterHelper.AddEqualsFilter(filters, document => document.Type, type);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildEmptyFilterDefinitionWhenValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:21:9
         string transaction = query.Advertise.Transaction.ToUpperInvariant() == NoFilter ? "" : query.Advertise.Transaction;
         string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
 
-        FilterHelper.AddEqualsFilter(filters, document => document.Type, type);
+        ;
         FilterHelper.AddEqualsFilter(filters, document => document.Transaction, transaction);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:22:9
         string status = query.Status.ToUpperInvariant() == NoFilter ? "" : query.Status;
 
         FilterHelper.AddEqualsFilter(filters, document => document.Type, type);
-        FilterHelper.AddEqualsFilter(filters, document => document.Transaction, transaction);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:23:9
 
         FilterHelper.AddEqualsFilter(filters, document => document.Type, type);
         FilterHelper.AddEqualsFilter(filters, document => document.Transaction, transaction);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:24:9
         FilterHelper.AddEqualsFilter(filters, document => document.Type, type);
         FilterHelper.AddEqualsFilter(filters, document => document.Transaction, transaction);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:25:9
         FilterHelper.AddEqualsFilter(filters, document => document.Transaction, transaction);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:26:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:27:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:28:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.Area, query.Attributes.Area.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:29:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.Area, query.Attributes.Area.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:30:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.Area, query.Attributes.Area.To);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:31:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.Area, query.Attributes.Area.To);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To);
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:32:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.Area, query.Attributes.Area.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To);
+        ;
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:33:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.Area, query.Attributes.Area.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To);
-        FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
+        ;
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:34:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To);
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
-        FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
+        ;
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:35:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To);
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
-        FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:36:9
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:37:9
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.To);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:38:9
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.To);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.From);

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:39:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.To);

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:40:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.SellingPrice, query.Prices.SellingPrice.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.From);
+        ;
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.To);
         FilterHelper.AddEqualsFilter(filters, document => document.Status, status);

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:41:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.From);
-        FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.To);
+        ;
         FilterHelper.AddEqualsFilter(filters, document => document.Status, status);
 

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:42:9
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.From);
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.To);
-        FilterHelper.AddEqualsFilter(filters, document => document.Status, status);
+        ;
 
         return filters.Count == 0 ? Builders<PropertyEntity>.Filter.Empty : Builders<PropertyEntity>.Filter.And(filters);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:44:16
         FilterHelper.AddLessOrEqualFilter(filters, document => document.RentalPrice, query.Prices.RentalPrice.To);
         FilterHelper.AddEqualsFilter(filters, document => document.Status, status);
 
-        return filters.Count == 0 ? Builders<PropertyEntity>.Filter.Empty : Builders<PropertyEntity>.Filter.And(filters);
+        return filters.Count != 0 ? Builders<PropertyEntity>.Filter.Empty : Builders<PropertyEntity>.Filter.And(filters);
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildEmptyFilterDefinitionWhenValuesAreNotRelevant
