[Killed] Conditional (true) mutation
properties-api-netcore/Core/Commons/ArgumentValidator.cs:11:16
 {
     public static T CheckNull<T>([AllowNull] T input, string parameterName, string message = null)
     {
-        return input is not null ? input : throw CreateArgumentNullException(parameterName, message);
+        return (true?input :throw CreateArgumentNullException(parameterName, message));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNull; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNullWithCustomMessage
