[Killed] Conditional (false) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:163:38
     {
         List<string> types = SanitizeTypes(_types);
 
-        List<string> propertyTypes = types.Any() ? types : new List<string> {PropertyType.All.Name};
+        List<string> propertyTypes = (false?types :new List<string> {PropertyType.All.Name});
 
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Survived] Conditional (true) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:163:38
     {
         List<string> types = SanitizeTypes(_types);
 
-        List<string> propertyTypes = types.Any() ? types : new List<string> {PropertyType.All.Name};
+        List<string> propertyTypes = (true?types :new List<string> {PropertyType.All.Name});
 
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();

[Killed] Conditional (true) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:205:16
             .Select(optional => optional.GetValue().Name)
             .ToList();
 
-        return sanitizeTypes?.Any() == true ? sanitizeTypes : new List<string> {PropertyType.All.Name};
+        return (true?sanitizeTypes :new List<string> {PropertyType.All.Name});
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Boolean mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:205:40
             .Select(optional => optional.GetValue().Name)
             .ToList();
 
-        return sanitizeTypes?.Any() == true ? sanitizeTypes : new List<string> {PropertyType.All.Name};
+        return sanitizeTypes?.Any() == false ? sanitizeTypes : new List<string> {PropertyType.All.Name};
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
