[Killed] Logical mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:27:39
 
         RuleFor(query => query.Attributes.NumberOfBedrooms)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To || numberOfBedrooms.To == 0)
+            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To && numberOfBedrooms.To == 0)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMinParametersValues

[Killed] Logical mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:32:38
 
         RuleFor(query => query.Attributes.NumberOfToilets)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To || numberOfToilets.To == 0)
+            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To && numberOfToilets.To == 0)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMinParametersValues
