[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:44:16
 
     private static ArgumentNullException CreateArgumentNullException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null);
+        return (false?new ArgumentNullException(parameterName) :new ArgumentNullException(message, (Exception) null));
     }
 
killedBy: UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:44:16
 
     private static ArgumentNullException CreateArgumentNullException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null);
+        return (true?new ArgumentNullException(parameterName) :new ArgumentNullException(message, (Exception) null));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNullWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNullWithCustomMessage

[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:49:16
 
     private static ArgumentException CreateArgumentException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message)
-            ? new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
-            : new ArgumentException(message, (Exception) null);
+        return (false?new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
+:new ArgumentException(message, (Exception) null));
     }
 }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNull

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:49:16
 
     private static ArgumentException CreateArgumentException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message)
-            ? new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
-            : new ArgumentException(message, (Exception) null);
+        return (true?new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
+:new ArgumentException(message, (Exception) null));
     }
 }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters
