[Killed] Block removal mutation
main/Core/Commons/Enumeration.cs:20:5
     protected Enumeration(int id, string name) => (Id, Name) = (id, name);
 
     public static IEnumerable<T> GetAll()
-    {
-        return ByName.Value.Values;
-    }
+    {}
 
     public static Optional<T> GetByName(string name)
killedBy: UnitTest.Core.Commons.EnumerationTest.SuccessfulToGetAllEnumerationItems; UnitTest.Core.Domains.Properties.Models.PropertyEnumerationTest.PropertyTypesExposeTheirExpectedIdentifiers; UnitTest.Core.Domains.Properties.Models.PropertyEnumerationTest.PropertyStatusesExposeTheirExpectedIdentifiers
