[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Commons/Extensions/JsonExtensions.cs:40:16
 
     public static JsonElement SelectToken(this JsonElement jsonElement, string path)
     {
-        while (!string.IsNullOrEmpty(path))
+        while (string.IsNullOrEmpty(path))
         {
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:40:17
 
     public static JsonElement SelectToken(this JsonElement jsonElement, string path)
     {
-        while (!string.IsNullOrEmpty(path))
+        while (!(path!=null))
         {
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:43:85
         while (!string.IsNullOrEmpty(path))
         {
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
-            string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
+            string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("");
             if (string.IsNullOrEmpty(indexAsString))
             {
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Negate expression
Core/Commons/Extensions/JsonExtensions.cs:71:13
 
     private static void ValidateSearchedIndex(int searchedIndex, int maxIndex, string arrayPropertyName)
     {
-        if (searchedIndex < 0)
+        if (!(searchedIndex < 0))
         {
             throw new ArgumentException($"The index {searchedIndex} is invalid.");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Equality mutation
Core/Commons/Extensions/JsonExtensions.cs:76:13
             throw new ArgumentException($"The index {searchedIndex} is invalid.");
         }
 
-        if (searchedIndex > maxIndex)
+        if (searchedIndex < maxIndex)
         {
             throw new ArgumentException($"The index {searchedIndex} is out of range of '{arrayPropertyName}' array. The max index is {maxIndex}.");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax
