[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
main/Core/Commons/JsonSchemaValidator.cs:40:22
         return
         [
             .. from keyValuePair in jSchema.Properties
-               where !jObject.ContainsKey(keyValuePair.Key)
+               where jObject.ContainsKey(keyValuePair.Key)
                select new FieldError
                {
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] String mutation
main/Core/Commons/JsonSchemaValidator.cs:43:68
                where !jObject.ContainsKey(keyValuePair.Key)
                select new FieldError
                {
-                   PropertyName = keyValuePair.Key, ErrorMessage = "CommonJsonPropertyMissing"
+                   PropertyName = keyValuePair.Key, ErrorMessage = ""
                }
         ];
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
main/Core/Commons/JsonSchemaValidator.cs:53:22
         return
         [
             .. from property in jObject.Properties()
-               where !jSchema.Properties.ContainsKey(property.Name)
+               where jSchema.Properties.ContainsKey(property.Name)
                select new FieldError
                {
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] Object initializer mutation
main/Core/Commons/JsonSchemaValidator.cs:54:23
         [
             .. from property in jObject.Properties()
                where !jSchema.Properties.ContainsKey(property.Name)
-               select new FieldError
-               {
-                   PropertyName = property.Name, AttemptedValue = property.Value.ToString(),
-                   ErrorMessage = "CommonJsonPropertyInvalid"
-               }
+               select new FieldError
+{}
         ];
     }
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema
