[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
main/Core/Commons/Optional.cs:31:16
 
     public bool HasValue()
     {
-        return !EqualityComparer<T>.Default.Equals(_value, default);
+        return EqualityComparer<T>.Default.Equals(_value, default);
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters
