[Killed] Statement mutation
Domains/Properties/Query/GetPropertyByUuidQuery.cs:17:9
     public GetPropertyByUuidQuery(string uuid)
     {
         Uuid = uuid;
-        Validator.ValidateAndThrow(this);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.Properties.Query.GetPropertyByUuidQueryTest.FailToGetPropertyByUuidWithNullOrEmptyUuid
