[Killed] Statement mutation
Domains/Properties/Query/GetPropertyByUuidQueryValidator.cs:9:9
 {
     public GetPropertyByUuidQueryValidator()
     {
-        RuleFor(query => query.Uuid)
-            .Cascade(CascadeMode.Stop)
-            .NotNull()
-            .WithMessage("ValidationPropertyIdIsNullOrEmpty");
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.GetPropertyByUuidQueryTest.FailToGetPropertyByUuidWithNullOrEmptyUuid
