[Survived] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBase.cs:12:5
     public byte Ranking { get; init; }
 
     protected SearchPropertiesQueryBase(List<string> types, string status, byte ranking)
-    {
-        Types = types;
-        Status = status;
-        Ranking = ranking;
-    }
+    {}
 }
