[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:34:5
     private List<string> _districts = [];
 
     public SearchPropertiesQueryBuilder WithTypes(List<string> types)
-    {
-        _types = types;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithTransaction(string transaction)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:46:5
     }
 
     public SearchPropertiesQueryBuilder WithMinBedrooms(byte minBedrooms)
-    {
-        _minBedrooms = minBedrooms;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMaxBedrooms(byte maxBedrooms)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:52:5
     }
 
     public SearchPropertiesQueryBuilder WithMaxBedrooms(byte maxBedrooms)
-    {
-        _maxBedrooms = maxBedrooms;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMinToilets(byte minToilets)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:58:5
     }
 
     public SearchPropertiesQueryBuilder WithMinToilets(byte minToilets)
-    {
-        _minToilets = minToilets;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMaxToilets(byte maxToilets)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:64:5
     }
 
     public SearchPropertiesQueryBuilder WithMaxToilets(byte maxToilets)
-    {
-        _maxToilets = maxToilets;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMinGarages(byte minGarages)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:70:5
     }
 
     public SearchPropertiesQueryBuilder WithMinGarages(byte minGarages)
-    {
-        _minGarages = minGarages;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMaxGarages(byte maxGarages)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:76:5
     }
 
     public SearchPropertiesQueryBuilder WithMaxGarages(byte maxGarages)
-    {
-        _maxGarages = maxGarages;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithCity(string city)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:112:5
     }
 
     public SearchPropertiesQueryBuilder WithMinBuiltArea(int minBuiltArea)
-    {
-        _minBuiltArea = minBuiltArea;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMaxBuiltArea(int maxBuiltArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:118:5
     }
 
     public SearchPropertiesQueryBuilder WithMaxBuiltArea(int maxBuiltArea)
-    {
-        _maxBuiltArea = maxBuiltArea;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithMinSellingPrice(float minSellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:124:5
     }
 
     public SearchPropertiesQueryBuilder WithMinSellingPrice(float minSellingPrice)
-    {
-        _minSellingPrice = minSellingPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToSellingPrice(float toSellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:130:5
     }
 
     public SearchPropertiesQueryBuilder WithToSellingPrice(float toSellingPrice)
-    {
-        _toSellingPrice = toSellingPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithFromRentalTotalPrice(float fromRentalTotalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:136:5
     }
 
     public SearchPropertiesQueryBuilder WithFromRentalTotalPrice(float fromRentalTotalPrice)
-    {
-        _fromRentalTotalPrice = fromRentalTotalPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithToRentalTotalPrice(float toRentalTotalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:142:5
     }
 
     public SearchPropertiesQueryBuilder WithToRentalTotalPrice(float toRentalTotalPrice)
-    {
-        _toRentalTotalPrice = toRentalTotalPrice;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQueryBuilder WithStatus(string status)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Survived] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:154:5
     }
     
     public SearchPropertiesQueryBuilder WithRanking(byte ranking)
-    {
-        _ranking = ranking;
-        return this;
-    }
+    {}
 
     public SearchPropertiesQuery Build()

[Killed] Conditional (false) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:163:38
     {
         List<string> types = SanitizeTypes(_types);
 
-        List<string> propertyTypes = types.Count > 0 ? types : [PropertyType.All.Name];
+        List<string> propertyTypes = (false?types :[PropertyType.All.Name]);
 
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Survived] Conditional (true) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:163:38
     {
         List<string> types = SanitizeTypes(_types);
 
-        List<string> propertyTypes = types.Count > 0 ? types : [PropertyType.All.Name];
+        List<string> propertyTypes = (true?types :[PropertyType.All.Name]);
 
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();

[Killed] Conditional (false) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:165:25
 
         List<string> propertyTypes = types.Count > 0 ? types : [PropertyType.All.Name];
 
-        string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
+        string status = (false?"ALL" :_status.ToUpper());
         string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
 
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Conditional (true) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:165:25
 
         List<string> propertyTypes = types.Count > 0 ? types : [PropertyType.All.Name];
 
-        string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
+        string status = (true?"ALL" :_status.ToUpper());
         string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Conditional (false) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:166:30
         List<string> propertyTypes = types.Count > 0 ? types : [PropertyType.All.Name];
 
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
-        string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
+        string transaction = (false?"ALL" :_transaction.ToUpper());
 
         SearchPropertiesQueryAdvertise queryAdvertise = new SearchPropertiesQueryAdvertise(transaction);
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Conditional (true) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:166:30
         List<string> propertyTypes = types.Count > 0 ? types : [PropertyType.All.Name];
 
         string status = string.IsNullOrWhiteSpace(_status) ? "ALL" : _status.ToUpper();
-        string transaction = string.IsNullOrWhiteSpace(_transaction) ? "ALL" : _transaction.ToUpper();
+        string transaction = (true?"ALL" :_transaction.ToUpper());
 
         SearchPropertiesQueryAdvertise queryAdvertise = new SearchPropertiesQueryAdvertise(transaction);
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Conditional (true) mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:205:16
             .Select(optional => optional.GetValue().Name)
             .ToList();
 
-        return sanitizeTypes?.Count > 0 ? sanitizeTypes : [PropertyType.All.Name];
+        return (true?sanitizeTypes :[PropertyType.All.Name]);
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryBuilder.cs:205:16
             .Select(optional => optional.GetValue().Name)
             .ToList();
 
-        return sanitizeTypes?.Count > 0 ? sanitizeTypes : [PropertyType.All.Name];
+        return sanitizeTypes?.Count < 0 ? sanitizeTypes : [PropertyType.All.Name];
     }
 }
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData
