[Killed] Block removal mutation
Domains/Properties/Query/SearchPropertiesQueryPrices.cs:18:5
         Range<float> sellingPrice,
         Range<float> rentalTotalPrice
     )
-    {
-        SellingPrice = sellingPrice;
-        RentalTotalPrice = rentalTotalPrice;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWhenPriceMaximumEqualsEpsilon
