[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:15:9
     
     public SearchPropertiesQueryValidator()
     {
-        RuleFor(query => query.Types)
-            .Cascade(CascadeMode.Stop)
-            .Must(types => types.TrueForAll(ArgumentChecker.IsValidEnumOf<PropertyType>))
-            .WithMessage("ValidationPropertyTypesAreInvalid");
+        ;
 
         RuleFor(query => query.Advertise.Transaction)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:18:26
         RuleFor(query => query.Types)
             .Cascade(CascadeMode.Stop)
             .Must(types => types.TrueForAll(ArgumentChecker.IsValidEnumOf<PropertyType>))
-            .WithMessage("ValidationPropertyTypesAreInvalid");
+            .WithMessage("");
 
         RuleFor(query => query.Advertise.Transaction)
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:25:9
             .Must(ArgumentChecker.IsValidEnumOf<Transaction>)
             .WithMessage("ValidationPropertyTransactionIsInvalid");
 
-        RuleFor(query => query.Attributes.NumberOfBedrooms)
-            .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To || numberOfBedrooms.To == 0)
-            .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.NumberOfToilets)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:27:87
 
         RuleFor(query => query.Attributes.NumberOfBedrooms)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To || numberOfBedrooms.To == 0)
+            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To || numberOfBedrooms.To != 0)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:27:39
 
         RuleFor(query => query.Attributes.NumberOfBedrooms)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To || numberOfBedrooms.To == 0)
+            .Must(numberOfBedrooms => numberOfBedrooms.From < numberOfBedrooms.To || numberOfBedrooms.To == 0)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:30:9
             .Must(numberOfBedrooms => numberOfBedrooms.From <= numberOfBedrooms.To || numberOfBedrooms.To == 0)
             .WithMessage("ValidationPropertyNumberOfBedroomsIsInvalid");
 
-        RuleFor(query => query.Attributes.NumberOfToilets)
-            .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To || numberOfToilets.To == 0)
-            .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.NumberOfGarages)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:32:38
 
         RuleFor(query => query.Attributes.NumberOfToilets)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To || numberOfToilets.To == 0)
+            .Must(numberOfToilets => numberOfToilets.From < numberOfToilets.To || numberOfToilets.To == 0)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:32:84
 
         RuleFor(query => query.Attributes.NumberOfToilets)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To || numberOfToilets.To == 0)
+            .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To || numberOfToilets.To != 0)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:35:9
             .Must(numberOfToilets => numberOfToilets.From <= numberOfToilets.To || numberOfToilets.To == 0)
             .WithMessage("ValidationPropertyNumberOfToiletsIsInvalid");
 
-        RuleFor(query => query.Attributes.NumberOfGarages)
-            .Cascade(CascadeMode.Stop)
-            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To || numberOfGarages.To == 0)
-            .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.Area)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:37:84
 
         RuleFor(query => query.Attributes.NumberOfGarages)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To || numberOfGarages.To == 0)
+            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To || numberOfGarages.To != 0)
             .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Logical mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:37:38
 
         RuleFor(query => query.Attributes.NumberOfGarages)
             .Cascade(CascadeMode.Stop)
-            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To || numberOfGarages.To == 0)
+            .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To && numberOfGarages.To == 0)
             .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMinParametersValues

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:40:9
             .Must(numberOfGarages => numberOfGarages.From <= numberOfGarages.To || numberOfGarages.To == 0)
             .WithMessage("ValidationPropertyNumberOfGaragesIsInvalid");
 
-        RuleFor(query => query.Attributes.Area)
-            .Cascade(CascadeMode.Stop)
-            .Must(area => area.From <= area.To || area.To == 0)
-            .WithMessage("ValidationPropertyAreaIsInvalid");
+        ;
 
         RuleFor(query => query.Attributes.BuiltArea)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:42:51
 
         RuleFor(query => query.Attributes.Area)
             .Cascade(CascadeMode.Stop)
-            .Must(area => area.From <= area.To || area.To == 0)
+            .Must(area => area.From <= area.To || area.To != 0)
             .WithMessage("ValidationPropertyAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:42:27
 
         RuleFor(query => query.Attributes.Area)
             .Cascade(CascadeMode.Stop)
-            .Must(area => area.From <= area.To || area.To == 0)
+            .Must(area => area.From > area.To || area.To == 0)
             .WithMessage("ValidationPropertyAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:43:26
         RuleFor(query => query.Attributes.Area)
             .Cascade(CascadeMode.Stop)
             .Must(area => area.From <= area.To || area.To == 0)
-            .WithMessage("ValidationPropertyAreaIsInvalid");
+            .WithMessage("");
 
         RuleFor(query => query.Attributes.BuiltArea)
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:45:9
             .Must(area => area.From <= area.To || area.To == 0)
             .WithMessage("ValidationPropertyAreaIsInvalid");
 
-        RuleFor(query => query.Attributes.BuiltArea)
-            .Cascade(CascadeMode.Stop)
-            .Must(builtArea => builtArea.From <= builtArea.To || builtArea.To == 0)
-            .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
+        ;
 
         RuleFor(query => query.Prices.SellingPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Logical mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:47:32
 
         RuleFor(query => query.Attributes.BuiltArea)
             .Cascade(CascadeMode.Stop)
-            .Must(builtArea => builtArea.From <= builtArea.To || builtArea.To == 0)
+            .Must(builtArea => builtArea.From <= builtArea.To && builtArea.To == 0)
             .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMinParametersValues

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:47:32
 
         RuleFor(query => query.Attributes.BuiltArea)
             .Cascade(CascadeMode.Stop)
-            .Must(builtArea => builtArea.From <= builtArea.To || builtArea.To == 0)
+            .Must(builtArea => builtArea.From > builtArea.To || builtArea.To == 0)
             .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
 
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:50:9
             .Must(builtArea => builtArea.From <= builtArea.To || builtArea.To == 0)
             .WithMessage("ValidationPropertyBuiltAreaIsInvalid");
 
-        RuleFor(query => query.Prices.SellingPrice)
-            .Cascade(CascadeMode.Stop)
-            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To || Math.Abs(sellingPrice.To) < Epsilon)
-            .WithMessage("ValidationPropertySellingPriceIsInvalid");
+        ;
         
         RuleFor(query => query.Prices.RentalTotalPrice)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWhenPriceMaximumEqualsEpsilon; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:52:75
 
         RuleFor(query => query.Prices.SellingPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To || Math.Abs(sellingPrice.To) < Epsilon)
+            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To || Math.Abs(sellingPrice.To) > Epsilon)
             .WithMessage("ValidationPropertySellingPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:52:35
 
         RuleFor(query => query.Prices.SellingPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(sellingPrice => sellingPrice.From <= sellingPrice.To || Math.Abs(sellingPrice.To) < Epsilon)
+            .Must(sellingPrice => sellingPrice.From > sellingPrice.To || Math.Abs(sellingPrice.To) < Epsilon)
             .WithMessage("ValidationPropertySellingPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWhenPriceMaximumEqualsEpsilon

[Killed] Statement mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:55:9
             .Must(sellingPrice => sellingPrice.From <= sellingPrice.To || Math.Abs(sellingPrice.To) < Epsilon)
             .WithMessage("ValidationPropertySellingPriceIsInvalid");
         
-        RuleFor(query => query.Prices.RentalTotalPrice)
-            .Cascade(CascadeMode.Stop)
-            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To || Math.Abs(rentalPrice.To) < Epsilon)
-            .WithMessage("ValidationPropertyRentalPriceIsInvalid");
+        ;
         
         RuleFor(query => query.Status)
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWhenPriceMaximumEqualsEpsilon; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.FailToSearchPropertiesWithInvalidParameters

[Killed] Equality mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:57:34
         
         RuleFor(query => query.Prices.RentalTotalPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To || Math.Abs(rentalPrice.To) < Epsilon)
+            .Must(rentalPrice => rentalPrice.From > rentalPrice.To || Math.Abs(rentalPrice.To) < Epsilon)
             .WithMessage("ValidationPropertyRentalPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryBuilderTests.SuccessfulToBuildSearchPropertiesQueryWithTestData

[Killed] Logical mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:57:34
         
         RuleFor(query => query.Prices.RentalTotalPrice)
             .Cascade(CascadeMode.Stop)
-            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To || Math.Abs(rentalPrice.To) < Epsilon)
+            .Must(rentalPrice => rentalPrice.From <= rentalPrice.To && Math.Abs(rentalPrice.To) < Epsilon)
             .WithMessage("ValidationPropertyRentalPriceIsInvalid");
         
killedBy: UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithEqualRangeLimits; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMaxParametersValues; UnitTest.Core.Domains.Properties.Query.SearchPropertiesQueryTest.SuccessToSearchPropertiesWithoutMinParametersValues

[Killed] String mutation
Domains/Properties/Query/SearchPropertiesQueryValidator.cs:63:26
         RuleFor(query => query.Status)
             .Cascade(CascadeMode.Stop)
             .Must(ArgumentChecker.IsValidEnumOf<PropertyStatus>)
-            .WithMessage("ValidationPropertyStatusIsInvalid");
+            .WithMessage("");
     }
 }
killedBy: UnitTest.Core.Domains.Properties.UseCases.SearchPropertiesUseCaseTest.SearchPropertiesWithValidParameters
