[Killed] Block removal mutation
Domains/Properties/UseCases/GetPropertyByUuidUseCase.cs:15:5
     private readonly IGetPropertyByUuidGateway _getPropertyByUuidGateway;
 
     public GetPropertyByUuidUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _getPropertyByUuidGateway = serviceResolver.Resolve<IGetPropertyByUuidGateway>();
-    }
+    {}
 
     public async Task<Property> ExecuteAsync(GetPropertyByUuidQuery query)
killedBy: UnitTest.Core.Domains.Properties.UseCases.GetPropertyByUuidUseCaseTest.SuccessfullyGetPropertyWhenPropertyFound; UnitTest.Core.Domains.Properties.UseCases.GetPropertyByUuidUseCaseTest.FailToGetPropertyWhenPropertyNotFound
