[Killed] Negate expression
EntryPoint.WebApi/Commons/Controllers/UrlHelper.cs:26:13
 
     private static string GetPort(string scheme, int? port)
     {
-        if (port is null || (HttpScheme.Equals(scheme) && DefaultHttpPort.Equals(port)) || (HttpsScheme.Equals(scheme) && DefaultHttpsPort.Equals(port)))
+        if (!(port is null || (HttpScheme.Equals(scheme) && DefaultHttpPort.Equals(port)) || (HttpsScheme.Equals(scheme) && DefaultHttpsPort.Equals(port))))
         {
             return string.Empty;
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.UrlHelperTest.SuccessfulToGetBaseUrl; IntegrationTest.EntryPoint.WebApi.Commons.UrlHelperTest.SuccessfulToGetBaseUrl; IntegrationTest.EntryPoint.WebApi.Commons.UrlHelperTest.SuccessfulToGetBaseUrl

[Killed] Logical mutation
EntryPoint.WebApi/Commons/Controllers/UrlHelper.cs:26:13
 
     private static string GetPort(string scheme, int? port)
     {
-        if (port is null || (HttpScheme.Equals(scheme) && DefaultHttpPort.Equals(port)) || (HttpsScheme.Equals(scheme) && DefaultHttpsPort.Equals(port)))
+        if (port is null || (HttpScheme.Equals(scheme) && DefaultHttpPort.Equals(port)) && (HttpsScheme.Equals(scheme) && DefaultHttpsPort.Equals(port)))
         {
             return string.Empty;
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.UrlHelperTest.SuccessfulToGetBaseUrl; IntegrationTest.EntryPoint.WebApi.Commons.UrlHelperTest.SuccessfulToGetBaseUrl; IntegrationTest.EntryPoint.WebApi.Commons.UrlHelperTest.SuccessfulToGetBaseUrl
