[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:15:5
 public sealed class ExceptionHandler : IExceptionHandler
 {
     public async Task<IActionResult> HandleAsync(Exception exception)
-    {
-        return exception switch
-        {
-            InvalidArgumentException invalidArgumentException => await IExceptionHandler.Dispatch(HandleInvalidArgumentException(invalidArgumentException)),
-            ValidationException validationException => await IExceptionHandler.Dispatch(HandleValidationException(validationException)),
-            NotFoundException => await IExceptionHandler.Dispatch(HandleNotFoundException(exception)),
-            UniqueConstraintException => await IExceptionHandler.Dispatch(HandleUniqueConstraintException(exception)),
-            ParentConstraintException => await IExceptionHandler.Dispatch(HandleParentConstraintException(exception)),
-            AccessDeniedException => await IExceptionHandler.Dispatch(HandleAccessDeniedException(exception)),
-            _ => await IExceptionHandler.Dispatch(HandleException())
-        };
-    }
+    {}
 
     private static ResponseStatus HandleInvalidArgumentException(CoreException exception)
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.FailedToGetByIdReturningInternalServerErrorInPtBr; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.FailedToGetByIdReturningInternalServerError; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.FailToSearchPropertiesReturningInternalServerError

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:29:5
     }
 
     private static ResponseStatus HandleInvalidArgumentException(CoreException exception)
-    {
-        InvalidArgumentException invalidArgumentException = (InvalidArgumentException) exception;
-        string message = IExceptionHandler.MessageFormatter(invalidArgumentException.Message, invalidArgumentException.Parameters);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.BadRequest, message, invalidArgumentException);
-    }
+    {}
 
     private static ResponseStatus HandleValidationException(ValidationException validationException)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:36:5
     }
 
     private static ResponseStatus HandleValidationException(ValidationException validationException)
-    {
-        string message = IExceptionHandler.MessageFormatter(nameof(Messages.CommonValidationAlert), null);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.BadRequest, message, validationException);
-    }
+    {}
 
     private static ResponseStatus HandleNotFoundException(Exception exception)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:42:5
     }
 
     private static ResponseStatus HandleNotFoundException(Exception exception)
-    {
-        NotFoundException notFoundException = (NotFoundException) exception;
-        string message = IExceptionHandler.MessageFormatter(notFoundException.Message, notFoundException.Parameters);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.NotFound, message);
-    }
+    {}
 
     private static ResponseStatus HandleUniqueConstraintException(Exception exception)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:49:5
     }
 
     private static ResponseStatus HandleUniqueConstraintException(Exception exception)
-    {
-        UniqueConstraintException uniqueConstraintException = (UniqueConstraintException) exception;
-        string message = IExceptionHandler.MessageFormatter(uniqueConstraintException.Message, uniqueConstraintException.Parameters);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.BadRequest, message);
-    }
+    {}
 
     private static ResponseStatus HandleParentConstraintException(Exception exception)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:56:5
     }
 
     private static ResponseStatus HandleParentConstraintException(Exception exception)
-    {
-        ParentConstraintException parentConstraintException = (ParentConstraintException) exception;
-        string message = IExceptionHandler.MessageFormatter(parentConstraintException.Message, parentConstraintException.Parameters);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.BadRequest, message);
-    }
+    {}
 
     private static ResponseStatus HandleAccessDeniedException(Exception exception)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/ExceptionHandler.cs:63:5
     }
 
     private static ResponseStatus HandleAccessDeniedException(Exception exception)
-    {
-        AccessDeniedException accessDeniedException = (AccessDeniedException) exception;
-        string message = IExceptionHandler.MessageFormatter(accessDeniedException.Message, accessDeniedException.Parameters);
-        return IExceptionHandler.BuildHttpResponseStatus(HttpStatusCode.Unauthorized, message);
-    }
+    {}
 
     private static ResponseStatus HandleException()
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException
