[Killed] Null coalescing mutation (left to right)
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:23:26
 
     public static string MessageFormatter(string messageKey, params object[] args)
     {
-        string message = Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture) ?? messageKey;
+        string message = messageKey ?? Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture);
         return args is null ? message : string.Format(message, args);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToFormatMessageIfKeyExistsInTheResourceFileForDefaultCulture; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToFormatMessageIfKeyExistsInTheResourceFileForPtBrCulture

[Killed] Null coalescing mutation (remove left)
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:23:26
 
     public static string MessageFormatter(string messageKey, params object[] args)
     {
-        string message = Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture) ?? messageKey;
+        string message = Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture);
         return args is null ? message : string.Format(message, args);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Equality mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:24:24
     public static string MessageFormatter(string messageKey, params object[] args)
     {
         string message = Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture) ?? messageKey;
-        return args is null ? message : string.Format(message, args);
+        return args is not null ? message : string.Format(message, args);
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Equality mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:31:36
     {
         ResponseStatus responseStatus = new ResponseStatus((int) httpStatusCode, message);
 
-        if (validationException is null || !validationException.Errors.Any()) return responseStatus;
+        if (validationException is not null || !validationException.Errors.Any()) return responseStatus;
 
         validationException.Errors
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Negate expression
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:31:13
     {
         ResponseStatus responseStatus = new ResponseStatus((int) httpStatusCode, message);
 
-        if (validationException is null || !validationException.Errors.Any()) return responseStatus;
+        if (!(validationException is null || !validationException.Errors.Any())) return responseStatus;
 
         validationException.Errors
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException

[Killed] Statement mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:33:9
 
         if (validationException is null || !validationException.Errors.Any()) return responseStatus;
 
-        validationException.Errors
-            .Select(failure => new Field(ToLowerCamelCase(GetPropertyName(failure.PropertyName)), MessageFormatter(failure.ErrorMessage),
-                failure.AttemptedValue as string))
-            .ToList()
-            .ForEach(responseStatus.Fields.Add);
+        ;
 
         return responseStatus;
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Statement mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:46:9
     {
         ResponseStatus responseStatus = new ResponseStatus((int) httpStatusCode, message);
 
-        invalidArgumentException.FieldErrors
-            .Select(CreateField)
-            .ToList()
-            .ForEach(responseStatus.Fields.Add);
+        ;
 
         return responseStatus;
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:55:5
     }
 
     private static Field CreateField(FieldError fieldError)
-    {
-        string name = ToLowerCamelCase(GetPropertyName(fieldError.PropertyName));
-        string message = MessageFormatter(fieldError.ErrorMessage, fieldError.PropertyName);
-        string value = fieldError.AttemptedValue;
-        return new Field(name, message, value);
-    }
+    {}
 
     private static string GetPropertyName(string propertyPath)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:64:16
 
     private static string GetPropertyName(string propertyPath)
     {
-        return !propertyPath.Contains('.') ? propertyPath : propertyPath.SubstringAfter(".");
+        return propertyPath.Contains('.') ? propertyPath : propertyPath.SubstringAfter(".");
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:68:5
     }
 
     private static string ToLowerCamelCase(string propertyName)
-    {
-        return char.ToLowerInvariant(propertyName[0]) + propertyName[1..];
-    }
+    {}
 
     public static async Task<IActionResult> Dispatch(ResponseStatus responseStatus)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:73:5
     }
 
     public static async Task<IActionResult> Dispatch(ResponseStatus responseStatus)
-    {
-        return await ResponseBuilder.BuildResponse((HttpStatusCode) responseStatus.Code, responseStatus);
-    }
+    {}
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.FailedToGetByIdReturningInternalServerErrorInPtBr; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.FailedToGetByIdReturningInternalServerError; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.FailToSearchPropertiesReturningInternalServerError
