[Killed] Statement mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:19:9
 
     public override void OnResultExecuting(ResultExecutingContext context)
     {
-        context.HttpContext.Response.Headers.Add(CorrelationIdHeader, GetCorrelationId(context));
+        ;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:23:5
     }
 
     private static string GetCorrelationId(ActionContext context)
-    {
-        Optional<string> optional = TryGetCorrelationIdFromHeader(context.HttpContext);
-        return optional.OrElse(Guid.NewGuid().ToString());
-    }
+    {}
 
     private static Optional<string> TryGetCorrelationIdFromHeader(HttpContext context)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:31:13
     private static Optional<string> TryGetCorrelationIdFromHeader(HttpContext context)
     {
         IHeaderDictionary headers = context.Request.Headers;
-        if (!headers.TryGetValue(CorrelationIdHeader, out StringValues values)) return Optional<string>.Empty();
+        if (headers.TryGetValue(CorrelationIdHeader, out StringValues values)) return Optional<string>.Empty();
 
         string correlationId = values.ToList()[0];
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:34:16
         if (!headers.TryGetValue(CorrelationIdHeader, out StringValues values)) return Optional<string>.Empty();
 
         string correlationId = values.ToList()[0];
-        return !string.IsNullOrWhiteSpace(correlationId) ? Optional<string>.Of(correlationId) : Optional<string>.Empty();
+        return string.IsNullOrWhiteSpace(correlationId) ? Optional<string>.Of(correlationId) : Optional<string>.Empty();
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders
