[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/GetCorrelationId.cs:16:5
     private readonly IHttpContextAccessor _httpContextAccessor;
 
     public GetCorrelationId(IHttpContextAccessor httpContextAccessor)
-    {
-        _httpContextAccessor = httpContextAccessor;
-    }
+    {}
 
     public string Execute()
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGenerateCorrelationIdIfItIsMissing; IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGetCorrelationIdIfHttpContextIsNull; IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGetCorrelationIdIfDoesNotExistsInContext

[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/GetCorrelationId.cs:22:13
 
     public string Execute()
     {
-        if (_httpContextAccessor.HttpContext == null) return Guid.NewGuid().ToString();
+        if (_httpContextAccessor.HttpContext != null) return Guid.NewGuid().ToString();
 
         Optional<string> optional = TryGetCorrelationIdFromHeader(_httpContextAccessor.HttpContext);
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGetCorrelationIdIfHttpContextIsNull; IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGetCorrelationIdFromHeader
