[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/LoggerAdapter.cs:13:5
     private readonly ILogger<T> _logger;
 
     public LoggerAdapter(ILoggerFactory loggerFactory)
-    {
-        _logger = loggerFactory.CreateLogger<T>();
-    }
+    {}
 
     public bool IsEnabled(LogLevel logLevel)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAWarningMessage; IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAnInformationMessage; IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAnErrorMessage

[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/LoggerAdapter.cs:18:5
     }
 
     public bool IsEnabled(LogLevel logLevel)
-    {
-        return _logger.IsEnabled(logLevel);
-    }
+    {}
 
     public void LogError(string message, params object[] args)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAWarningMessage; IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAnInformationMessage; IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAnErrorMessage

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/LoggerAdapter.cs:24:9
 
     public void LogError(string message, params object[] args)
     {
-        _logger.Log(LogLevel.Error, message, args);
+        ;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAnErrorMessage

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/LoggerAdapter.cs:29:9
 
     public void LogWarning(string message, params object[] args)
     {
-        _logger.Log(LogLevel.Warning, message, args);
+        ;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAWarningMessage

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/LoggerAdapter.cs:34:9
 
     public void LogInformation(string message, params object[] args)
     {
-        _logger.Log(LogLevel.Information, message, args);
+        ;
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.LoggerAdapterTest.SuccessfulToLogAnInformationMessage
