[Survived] Block removal mutation
EntryPoint.WebApi/Commons/Models/Field.cs:19:5
     public string Value { get; }
 
     public Field(string name, string message, string value)
-    {
-        Name = name;
-        Message = message;
-        Value = value;
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
