[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Models/ResponseStatus.cs:21:5
     public List<Field> Fields { get; }
 
     public ResponseStatus(int code, string message)
-    {
-        Code = code;
-        Message = message;
-        Fields = new List<Field>(0);
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException
