[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:19:16
 
     public static string Sanitize(string[] sortableFields, List<string> rawOrderBys)
     {
-        return rawOrderBys != null ? Sanitize(sortableFields, string.Join(",", rawOrderBys)) : string.Empty;
+        return rawOrderBys == null ? Sanitize(sortableFields, string.Join(",", rawOrderBys)) : string.Empty;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:24:13
 
     public static string Sanitize(string[] sortableFields, string rawOrderBy)
     {
-        if (string.IsNullOrWhiteSpace(rawOrderBy)) return string.Empty;
+        if (!(string.IsNullOrWhiteSpace(rawOrderBy))) return string.Empty;
 
         string orderBy = BlankSpaces().Replace(rawOrderBy, "");
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:26:60
     {
         if (string.IsNullOrWhiteSpace(rawOrderBy)) return string.Empty;
 
-        string orderBy = BlankSpaces().Replace(rawOrderBy, "");
+        string orderBy = BlankSpaces().Replace(rawOrderBy, "Stryker was here!");
         string[] values = orderBy.Split(Separators);
         List<string> sanitized = new List<string>();
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:32:37
 
         foreach (string value in values)
         {
-            AddDirection(sanitized, IsDirectionCommand(value) ? value : AscendingDirection);
+            AddDirection(sanitized, !(IsDirectionCommand(value) ) ? value : AscendingDirection);
             if (sortableFields == null) continue;
             foreach (string field in sortableFields)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:32:13
 
         foreach (string value in values)
         {
-            AddDirection(sanitized, IsDirectionCommand(value) ? value : AscendingDirection);
+            ;
             if (sortableFields == null) continue;
             foreach (string field in sortableFields)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:33:17
         foreach (string value in values)
         {
             AddDirection(sanitized, IsDirectionCommand(value) ? value : AscendingDirection);
-            if (sortableFields == null) continue;
+            if (sortableFields != null) continue;
             foreach (string field in sortableFields)
             {
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:33:41
         foreach (string value in values)
         {
             AddDirection(sanitized, IsDirectionCommand(value) ? value : AscendingDirection);
-            if (sortableFields == null) continue;
+            if (sortableFields == null) ;
             foreach (string field in sortableFields)
             {
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToSanitizeEmptyOrdersByQueryParameters

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:36:88
             if (sortableFields == null) continue;
             foreach (string field in sortableFields)
             {
-                if (!field.Equals(value, StringComparison.InvariantCultureIgnoreCase)) continue;
+                if (!field.Equals(value, StringComparison.InvariantCultureIgnoreCase)) ;
                 sanitized.Add(field);
                 break;
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:36:21
             if (sortableFields == null) continue;
             foreach (string field in sortableFields)
             {
-                if (!field.Equals(value, StringComparison.InvariantCultureIgnoreCase)) continue;
+                if (field.Equals(value, StringComparison.InvariantCultureIgnoreCase)) continue;
                 sanitized.Add(field);
                 break;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:37:17
             foreach (string field in sortableFields)
             {
                 if (!field.Equals(value, StringComparison.InvariantCultureIgnoreCase)) continue;
-                sanitized.Add(field);
+                ;
                 break;
             }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Survived] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:38:17
             {
                 if (!field.Equals(value, StringComparison.InvariantCultureIgnoreCase)) continue;
                 sanitized.Add(field);
-                break;
+                ;
             }
         }

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:42:9
             }
         }
 
-        AddDirection(sanitized, AscendingDirection);
+        ;
 
         return string.Join(",", sanitized.Where(it => !string.IsNullOrEmpty(it)));
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:44:55
 
         AddDirection(sanitized, AscendingDirection);
 
-        return string.Join(",", sanitized.Where(it => !string.IsNullOrEmpty(it)));
+        return string.Join(",", sanitized.Where(it => string.IsNullOrEmpty(it)));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:44:56
 
         AddDirection(sanitized, AscendingDirection);
 
-        return string.Join(",", sanitized.Where(it => !string.IsNullOrEmpty(it)));
+        return string.Join(",", sanitized.Where(it => !(it!=null)));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Statement mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:49:72
 
     private static void AddDirection(IList<string> sanitized, string value)
     {
-        if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) return;
+        if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) ;
         sanitized[^1] = string.Concat(sanitized[^1], ":", value.ToUpper());
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:49:13
 
     private static void AddDirection(IList<string> sanitized, string value)
     {
-        if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) return;
+        if (sanitized.Count > 0 || IsDirectionCommand(sanitized[^1])) return;
         sanitized[^1] = string.Concat(sanitized[^1], ":", value.ToUpper());
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:50:54
     private static void AddDirection(IList<string> sanitized, string value)
     {
         if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) return;
-        sanitized[^1] = string.Concat(sanitized[^1], ":", value.ToUpper());
+        sanitized[^1] = string.Concat(sanitized[^1], "", value.ToUpper());
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Logical mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:55:16
 
     private static bool IsDirectionCommand(string value)
     {
-        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
-               value!.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
-               value!.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
+        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
+               value!.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) &&
+               value!.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Logical mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:55:16
 
     private static bool IsDirectionCommand(string value)
     {
-        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
-               value!.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
+        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) &&
+               value!.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
                value!.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:56:32
     private static bool IsDirectionCommand(string value)
     {
         return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
-               value!.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
+               value!.EndsWith($"", StringComparison.InvariantCultureIgnoreCase) ||
                value!.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders
