[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:20:26
 
     public static PageRequest Of(string rawPageNumber, string rawPageSize, string rawOrderBy)
     {
-        int pageNumber = int.TryParse(rawPageNumber, out int intPageNumber) ? intPageNumber : 0;
+        int pageNumber = !(int.TryParse(rawPageNumber, out int intPageNumber) ) ? intPageNumber : 0;
         int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize > 0 ? intPageSize : PageRequest.DefaultPageSize;
         return PageRequest.Of(pageNumber, pageSize, GetSort(rawOrderBy));
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSize; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:21:74
     public static PageRequest Of(string rawPageNumber, string rawPageSize, string rawOrderBy)
     {
         int pageNumber = int.TryParse(rawPageNumber, out int intPageNumber) ? intPageNumber : 0;
-        int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize > 0 ? intPageSize : PageRequest.DefaultPageSize;
+        int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize >= 0 ? intPageSize : PageRequest.DefaultPageSize;
         return PageRequest.Of(pageNumber, pageSize, GetSort(rawOrderBy));
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreInvalidAndSortIsInvalid

[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:21:24
     public static PageRequest Of(string rawPageNumber, string rawPageSize, string rawOrderBy)
     {
         int pageNumber = int.TryParse(rawPageNumber, out int intPageNumber) ? intPageNumber : 0;
-        int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize > 0 ? intPageSize : PageRequest.DefaultPageSize;
+        int pageSize = !(int.TryParse(rawPageSize, out int intPageSize) && intPageSize > 0 ) ? intPageSize : PageRequest.DefaultPageSize;
         return PageRequest.Of(pageNumber, pageSize, GetSort(rawOrderBy));
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreInvalidAndSortIsInvalid; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSize; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreBlank

[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:27:13
 
     private static Sort GetSort(string rawOrderBy)
     {
-        if (string.IsNullOrWhiteSpace(rawOrderBy)) return Sort.Unsorted;
+        if (!(string.IsNullOrWhiteSpace(rawOrderBy))) return Sort.Unsorted;
 
         string orderBy = BlankSpaces().Replace(rawOrderBy, "");
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreNull; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] String mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:27:13
 
     private static Sort GetSort(string rawOrderBy)
     {
-        if (string.IsNullOrWhiteSpace(rawOrderBy)) return Sort.Unsorted;
+        if ((rawOrderBy!="")) return Sort.Unsorted;
 
         string orderBy = BlankSpaces().Replace(rawOrderBy, "");
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:35:26
         
         List<string> properties = strings
             .Select(it => it.SubstringBefore(DirectionSeparator))
-            .Where(it => !string.IsNullOrWhiteSpace(it)).ToList();
+            .Where(it => string.IsNullOrWhiteSpace(it)).ToList();
         
         return properties.Count == 0 ? Sort.Unsorted : Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList());
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreInvalidAndSortIsInvalid; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] String mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:35:27
         
         List<string> properties = strings
             .Select(it => it.SubstringBefore(DirectionSeparator))
-            .Where(it => !string.IsNullOrWhiteSpace(it)).ToList();
+            .Where(it => !(it!=null)).ToList();
         
         return properties.Count == 0 ? Sort.Unsorted : Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList());
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:37:16
             .Select(it => it.SubstringBefore(DirectionSeparator))
             .Where(it => !string.IsNullOrWhiteSpace(it)).ToList();
         
-        return properties.Count == 0 ? Sort.Unsorted : Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList());
+        return properties.Count != 0 ? Sort.Unsorted : Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList());
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreInvalidAndSortIsInvalid; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:41:5
     }
 
     private static Order GetOrder(string property, string orderBy)
-    {
-        Direction direction = GetDirection(property, orderBy);
-        return new Order(direction, property);
-    }
+    {}
 
     private static Direction GetDirection(string property, string orderBy)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:50:16
     {
         string direction = orderBy.SubstringAfter(property + DirectionSeparator).SubstringBefore(FieldSeparator);
         bool isDescending = string.Equals(direction, Convert.ToString(Direction.Desc), StringComparison.InvariantCultureIgnoreCase);
-        return isDescending ? Direction.Desc : Direction.Asc;
+        return !(isDescending ) ? Direction.Desc : Direction.Asc;
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort
