[Killed] Null coalescing mutation (left to right)
properties-api-netcore/EntryPoint.WebApi/Commons/ServiceResolver.cs:16:27
     public void Setup(IServiceProvider serviceProvider, Dictionary<Type, ServiceLifetime> lifetimeByType = null)
     {
         _serviceProvider = serviceProvider;
-        _lifetimeByType = lifetimeByType ?? new Dictionary<Type, ServiceLifetime>(0);
+        _lifetimeByType = new Dictionary<Type, ServiceLifetime>(0) ?? lifetimeByType;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.FailToResolveSingletonService; IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveSingletonService

[Killed] Null coalescing mutation (remove left)
properties-api-netcore/EntryPoint.WebApi/Commons/ServiceResolver.cs:16:27
     public void Setup(IServiceProvider serviceProvider, Dictionary<Type, ServiceLifetime> lifetimeByType = null)
     {
         _serviceProvider = serviceProvider;
-        _lifetimeByType = lifetimeByType ?? new Dictionary<Type, ServiceLifetime>(0);
+        _lifetimeByType = lifetimeByType;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveNonSingletonService

[Killed] Negate expression
properties-api-netcore/EntryPoint.WebApi/Commons/ServiceResolver.cs:23:13
     {
         Type type = typeof(T);
 
-        if (_lifetimeByType.TryGetValue(type, out ServiceLifetime _))
+        if (!(_lifetimeByType.TryGetValue(type, out ServiceLifetime _)))
         {
             T service = (T) _serviceProvider.GetService(type);
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.FailToResolveSingletonService; IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveSingletonService

[Killed] Block removal mutation
properties-api-netcore/EntryPoint.WebApi/Commons/ServiceResolver.cs:24:9
         Type type = typeof(T);
 
         if (_lifetimeByType.TryGetValue(type, out ServiceLifetime _))
-        {
-            T service = (T) _serviceProvider.GetService(type);
-            return ArgumentValidator.CheckNull(service, nameof(type));
-        }
+        {}
 
         using IServiceScope scope = _serviceProvider.CreateScope();
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.FailToResolveSingletonService; IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveSingletonService
