[Killed] Block removal mutation
Domains/Properties/EntryPoints/GetPropertyByUuidApiMethod.cs:22:5
     private readonly IGetPropertyByUuidController _controller;
 
     public GetPropertyByUuidApiMethod(IGetPropertyByUuidController controller)
-    {
-        _controller = ArgumentValidator.CheckNull(controller, nameof(controller));
-    }
+    {}
 
     [SwaggerOperation(
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.SuccessfulToGetByUuidReturningProperty

[Killed] Block removal mutation
Domains/Properties/EntryPoints/GetPropertyByUuidApiMethod.cs:37:5
     [ProducesResponseType(typeof(ResponseStatus), 500)]
     [HttpGet("{uuid}")]
     public Task<IActionResult> GetPropertyByUuid(string uuid)
-    {
-        return _controller.ExecuteAsync(uuid);
-    }
+    {}
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.SuccessfulToGetByUuidReturningProperty
