[Killed] Block removal mutation
Domains/Properties/EntryPoints/GetPropertyByUuidController.cs:19:5
     private readonly IGetPropertyByUuidUseCase _useCase;
 
     public GetPropertyByUuidController(IGetPropertyByUuidUseCase useCase)
-    {
-        _useCase = useCase;
-    }
+    {}
 
     public async Task<IActionResult> ExecuteAsync(string uuid)
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.SuccessfulToGetByUuidReturningProperty

[Killed] Block removal mutation
Domains/Properties/EntryPoints/GetPropertyByUuidController.cs:24:5
     }
 
     public async Task<IActionResult> ExecuteAsync(string uuid)
-    {
-        GetPropertyByUuidQuery query = new GetPropertyByUuidQuery(uuid);
-        Property property = await _useCase.ExecuteAsync(query);
-        PropertyResponse propertyResponse = PropertyPresenter.Of(property);
-        return await ResponseBuilder.BuildResponse(HttpStatusCode.OK, propertyResponse);
-    }
+    {}
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.SuccessfulToGetByUuidReturningProperty; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.FailedToGetByIdReturningInternalServerErrorInPtBr; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.FailedToGetByIdReturningInternalServerError
