[Killed] Block removal mutation
Domains/Properties/EntryPoints/SearchPropertiesApiMethod.cs:23:5
     private readonly ISearchPropertiesController _controller;
 
     public SearchPropertiesApiMethod(ISearchPropertiesController controller)
-    {
-        _controller = ArgumentValidator.CheckNull(controller, nameof(controller));
-    }
+    {}
 
     [SwaggerOperation(
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Block removal mutation
Domains/Properties/EntryPoints/SearchPropertiesApiMethod.cs:40:5
     [ProducesResponseType(typeof(ResponseStatus), 500)]
     [HttpGet]
     public Task<IActionResult> SearchProperties(SearchPropertiesRequest request, QPageRequest qPageRequest, CancellationToken cancellationToken = default)
-    {
-        return _controller.ExecuteAsync(request, qPageRequest);
-    }
+    {}
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent
