[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:27:9
     {
         "id", // Identifier 
         "type", // Type: APARTMENT, HOUSE, ETC...
-        "transaction", // Transaction: RENT or SALE
+        "", // Transaction: RENT or SALE
         "numberOfBedrooms", "numberOfToilets", "numberOfGarages", // Amenities
         "area", "builtArea", // Area

[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:32:45
         "area", "builtArea", // Area
         "city", "state", "district", // Location
         "ranking", // Advertise
-        "sellingPrice", "rentalTotalPrice", "rentalPrice", "priceByM2", // Prices 
+        "sellingPrice", "rentalTotalPrice", "", "priceByM2", // Prices 
         "createdAt", "updatedAt" // Dates
     };

[Survived] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:32:9
         "area", "builtArea", // Area
         "city", "state", "district", // Location
         "ranking", // Advertise
-        "sellingPrice", "rentalTotalPrice", "rentalPrice", "priceByM2", // Prices 
+        "", "rentalTotalPrice", "rentalPrice", "priceByM2", // Prices 
         "createdAt", "updatedAt" // Dates
     };

[Killed] Block removal mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:44:5
     private const float DefaultMaxPrice = 100000000;
 
     public SearchPropertiesController(IHttpContextAccessor httpContextAccessor, ISearchPropertiesUseCase useCase)
-    {
-        _httpContextAccessor = ArgumentValidator.CheckNull(httpContextAccessor, nameof(httpContextAccessor));
-        _useCase = ArgumentValidator.CheckNull(useCase, nameof(useCase));
-    }
+    {}
 
     public async Task<IActionResult> ExecuteAsync(SearchPropertiesRequest request, QPageRequest qPageRequest)
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:61:13
 
         PageableSearchPropertiesResponse response = SearchPropertiesPresenter.Of(page, baseUrl);
 
-        if (page.Pageable.TotalPages == 0 || pageRequest.PageNumber >= page.Pageable.TotalPages)
+        if (page.Pageable.TotalPages != 0 || pageRequest.PageNumber >= page.Pageable.TotalPages)
         {
             return await ResponseBuilder.BuildResponse(HttpStatusCode.NoContent);
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:61:46
 
         PageableSearchPropertiesResponse response = SearchPropertiesPresenter.Of(page, baseUrl);
 
-        if (page.Pageable.TotalPages == 0 || pageRequest.PageNumber >= page.Pageable.TotalPages)
+        if (page.Pageable.TotalPages == 0 || pageRequest.PageNumber < page.Pageable.TotalPages)
         {
             return await ResponseBuilder.BuildResponse(HttpStatusCode.NoContent);
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Block removal mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:62:9
         PageableSearchPropertiesResponse response = SearchPropertiesPresenter.Of(page, baseUrl);
 
         if (page.Pageable.TotalPages == 0 || pageRequest.PageNumber >= page.Pageable.TotalPages)
-        {
-            return await ResponseBuilder.BuildResponse(HttpStatusCode.NoContent);
-        }
+        {}
 
         return await (page.Pageable.TotalPages switch
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:75:30
 
     private static SearchPropertiesQuery BuildSearchPropertiesQuery(SearchPropertiesRequest request)
     {
-        List<string> types = request.Types == null || request.Types.Count == 0 ? new List<string>() : request.Types;
+        List<string> types = request.Types != null || request.Types.Count == 0 ? new List<string>() : request.Types;
 
         Transaction transaction = Transaction.GetByName(request.Transaction).OrElse(Transaction.All);
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:75:55
 
     private static SearchPropertiesQuery BuildSearchPropertiesQuery(SearchPropertiesRequest request)
     {
-        List<string> types = request.Types == null || request.Types.Count == 0 ? new List<string>() : request.Types;
+        List<string> types = request.Types == null || request.Types.Count != 0 ? new List<string>() : request.Types;
 
         Transaction transaction = Transaction.GetByName(request.Transaction).OrElse(Transaction.All);
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:79:24
 
         Transaction transaction = Transaction.GetByName(request.Transaction).OrElse(Transaction.All);
         string status = PropertyStatus.GetByName(request.Status).OrElse(PropertyStatus.All).Name;
-        byte ranking = request.Ranking > 0 ? request.Ranking : (byte) 0;
+        byte ranking = !(request.Ranking > 0 ) ? request.Ranking : (byte) 0;
 
         SearchPropertiesQueryBuilder builder = new SearchPropertiesQueryBuilder();
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:79:24
 
         Transaction transaction = Transaction.GetByName(request.Transaction).OrElse(Transaction.All);
         string status = PropertyStatus.GetByName(request.Status).OrElse(PropertyStatus.All).Name;
-        byte ranking = request.Ranking > 0 ? request.Ranking : (byte) 0;
+        byte ranking = request.Ranking < 0 ? request.Ranking : (byte) 0;
 
         SearchPropertiesQueryBuilder builder = new SearchPropertiesQueryBuilder();
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Logical mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:83:23
 
         SearchPropertiesQueryBuilder builder = new SearchPropertiesQueryBuilder();
 
-        bool isSale = transaction.Is(Transaction.All) || transaction.Is(Transaction.Sale);
+        bool isSale = transaction.Is(Transaction.All) && transaction.Is(Transaction.Sale);
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2

[Killed] Logical mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:84:23
         SearchPropertiesQueryBuilder builder = new SearchPropertiesQueryBuilder();
 
         bool isSale = transaction.Is(Transaction.All) || transaction.Is(Transaction.Sale);
-        bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
+        bool isRent = transaction.Is(Transaction.All) && transaction.Is(Transaction.Rent);
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:86:33
         bool isSale = transaction.Is(Transaction.All) || transaction.Is(Transaction.Sale);
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
-        float sellingPriceMin = isSale ? request.MinPrice : 0;
+        float sellingPriceMin = !(isSale ) ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Logical mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:87:33
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
-        float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
+        float sellingPriceMax = isSale || request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:87:43
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
-        float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
+        float sellingPriceMax = isSale && request.MaxPrice < 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:88:37
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
-        float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
+        float rentalTotalPriceMin = !(isRent ) ? request.MinPrice : 0;
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Logical mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:89:37
         float sellingPriceMin = isSale ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
-        float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
+        float rentalTotalPriceMax = isRent || request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:89:47
         float sellingPriceMin = isSale ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
-        float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
+        float rentalTotalPriceMax = isRent && request.MaxPrice < 0 ? request.MaxPrice : DefaultMaxPrice;
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Survived] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:91:28
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
-        byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
+        byte minBedrooms = request.MinBedrooms >= 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;

[Survived] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:91:28
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
-        byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
+        byte minBedrooms = request.MinBedrooms < 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:92:28
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
-        byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
+        byte maxBedrooms = !(request.MaxBedrooms > 0 ) ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:92:28
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
-        byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
+        byte maxBedrooms = request.MaxBedrooms < 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:93:27
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
-        byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
+        byte minToilets = request.MinToilets < 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:93:27
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
-        byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
+        byte minToilets = !(request.MinToilets > 0 ) ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:94:27
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
-        byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
+        byte maxToilets = request.MaxToilets < 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:94:27
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
-        byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
+        byte maxToilets = !(request.MaxToilets > 0 ) ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:95:27
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
-        byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
+        byte minGarages = request.MinGarages < 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:95:27
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
-        byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
+        byte minGarages = !(request.MinGarages > 0 ) ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:96:27
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
-        byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
+        byte maxGarages = !(request.MaxGarages > 0 ) ? request.MaxGarages : DefaultMaxRooms;
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:96:27
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
-        byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
+        byte maxGarages = request.MaxGarages < 0 ? request.MaxGarages : DefaultMaxRooms;
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:98:23
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
-        int minArea = request.MinArea > 0 ? request.MinArea : 0;
+        int minArea = request.MinArea < 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:98:23
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
-        int minArea = request.MinArea > 0 ? request.MinArea : 0;
+        int minArea = !(request.MinArea > 0 ) ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent
