[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:99:23
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
-        int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
+        int maxArea = !(request.MaxArea > 0 ) ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:99:23
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
-        int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
+        int maxArea = request.MaxArea < 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:100:28
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
-        int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
+        int minBuiltArea = !(request.MinBuiltArea > 0 ) ? request.MinBuiltArea : 0;
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:100:28
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
-        int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
+        int minBuiltArea = request.MinBuiltArea < 0 ? request.MinBuiltArea : 0;
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Equality mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:101:28
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
-        int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
+        int maxBuiltArea = request.MaxBuiltArea < 0 ? request.MaxBuiltArea : DefaultMaxArea;
 
         List<string> districts = request.Districts?
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Negate expression
Domains/Properties/EntryPoints/SearchPropertiesController.cs:101:28
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
-        int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
+        int maxBuiltArea = !(request.MaxBuiltArea > 0 ) ? request.MaxBuiltArea : DefaultMaxArea;
 
         List<string> districts = request.Districts?
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:104:31
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
 
         List<string> districts = request.Districts?
-            .Where(element => !string.IsNullOrEmpty(element))
+            .Where(element => string.IsNullOrEmpty(element))
             .SelectMany(element => element.Split(','))
             .ToList();
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] String mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:104:32
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
 
         List<string> districts = request.Districts?
-            .Where(element => !string.IsNullOrEmpty(element))
+            .Where(element => !(element!=""))
             .SelectMany(element => element.Split(','))
             .ToList();
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Statement mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:108:9
             .SelectMany(element => element.Split(','))
             .ToList();
 
-        builder
-            .WithTypes(types)
-            .WithTransaction(transaction.Name)
-            .WithState(request.State)
-            .WithCity(request.City)
-            .WithDistricts(districts)
-            .WithMinBedrooms(minBedrooms)
-            .WithMaxBedrooms(maxBedrooms)
-            .WithMinToilets(minToilets)
-            .WithMaxToilets(maxToilets)
-            .WithMinGarages(minGarages)
-            .WithMaxGarages(maxGarages)
-            .WithFromArea(minArea)
-            .WithToArea(maxArea)
-            .WithMinBuiltArea(minBuiltArea)
-            .WithMaxBuiltArea(maxBuiltArea)
-            .WithMinSellingPrice(sellingPriceMin)
-            .WithToSellingPrice(sellingPriceMax)
-            .WithFromRentalTotalPrice(rentalTotalPriceMin)
-            .WithToRentalTotalPrice(rentalTotalPriceMax)
-            .WithStatus(status)
-            .WithRanking(ranking);
+        ;
 
         return builder.Build();
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent
