[Killed] String mutation
Domains/Properties/Presenters/PropertyPresenter.cs:41:53
             Ranking = property.Ranking,
             Status = property.Status.Name.ToUpperInvariant(),
             CreatedAt = property.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
-            UpdatedAt = property.UpdatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
+            UpdatedAt = property.UpdatedAt.ToString(""),
         };
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.GetPropertyByUuidApiMethodTest.SuccessfulToGetByUuidReturningProperty
