[Killed] Block removal mutation
Domains/Properties/Presenters/SearchPropertiesPresenter.cs:12:5
 public static class SearchPropertiesPresenter
 {
     public static PageableSearchPropertiesResponse Of(Page<Property> page, string baseUrl)
-    {
-        List<SearchPropertiesInnerResponse> content = page.Content.Select(it => Of(it, baseUrl)).ToList();
-        return new PageableSearchPropertiesResponse(content, page.Pageable);
-    }
+    {}
 
     private static SearchPropertiesInnerResponse Of(Property property, string baseUrl)
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Survived] Linq method mutation (FirstOrDefault() to First())
Domains/Properties/Presenters/SearchPropertiesPresenter.cs:32:26
             // Introduction = introduction,
             // Url = property.Advertise.Url,
             // RefId = property.Advertise.RefId,
-            CoverImage = property.Advertise.Images.FirstOrDefault(),
+            CoverImage = property.Advertise.Images.First(),
             NumberOfBedrooms = property.Attributes.NumberOfBedrooms,
             // NumberOfToilets = property.Attributes.NumberOfToilets,
