[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
properties-api-netcore/EntryPoint.WebApi/Commons/CorrelationIdHeaderReader.cs:15:13
     public static Optional<string> TryGetFromHeader(HttpContext context)
     {
         IHeaderDictionary headers = context.Request.Headers;
-        if (!headers.TryGetValue(HeaderName, out StringValues values)) return Optional<string>.Empty();
+        if (headers.TryGetValue(HeaderName, out StringValues values)) return Optional<string>.Empty();
 
         string correlationId = values.ToList()[0];
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId; IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGetCorrelationIdIfDoesNotExistsInContext
