[Killed] Statement mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:14:9
 {
     public override void OnResultExecuting(ResultExecutingContext context)
     {
-        context.HttpContext.Response.Headers.Add(CorrelationIdHeaderReader.HeaderName, GetCorrelationId(context));
+        ;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId

[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:18:5
     }
 
     private static string GetCorrelationId(ActionContext context)
-    {
-        Optional<string> optional = CorrelationIdHeaderReader.TryGetFromHeader(context.HttpContext);
-        return optional.OrElse(Guid.NewGuid().ToString());
-    }
+    {}
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId
