[Killed] Conditional (true) mutation
properties-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:19:16
 
     public static string Sanitize(string[] sortableFields, List<string> rawOrderBys)
     {
-        return rawOrderBys != null ? Sanitize(sortableFields, string.Join(",", rawOrderBys)) : string.Empty;
+        return (true?Sanitize(sortableFields, string.Join(",", rawOrderBys)) :string.Empty);
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToSanitizeEmptyOrdersByQueryParameters
