[Killed] Equality mutation
properties-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:21:74
     public static PageRequest Of(string rawPageNumber, string rawPageSize, string rawOrderBy)
     {
         int pageNumber = int.TryParse(rawPageNumber, out int intPageNumber) ? intPageNumber : 0;
-        int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize > 0 ? intPageSize : PageRequest.DefaultPageSize;
+        int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize < 0 ? intPageSize : PageRequest.DefaultPageSize;
         return PageRequest.Of(pageNumber, pageSize, GetSort(rawOrderBy));
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSize; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort
