[Killed] Conditional (true) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:75:30
 
     private static SearchPropertiesQuery BuildSearchPropertiesQuery(SearchPropertiesRequest request)
     {
-        List<string> types = request.Types == null || request.Types.Count == 0 ? new List<string>() : request.Types;
+        List<string> types = (true?new List<string>() :request.Types);
 
         Transaction transaction = Transaction.GetByName(request.Transaction).OrElse(Transaction.All);
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:79:24
 
         Transaction transaction = Transaction.GetByName(request.Transaction).OrElse(Transaction.All);
         string status = PropertyStatus.GetByName(request.Status).OrElse(PropertyStatus.All).Name;
-        byte ranking = request.Ranking > 0 ? request.Ranking : (byte) 0;
+        byte ranking = (false?request.Ranking :(byte) 0);
 
         SearchPropertiesQueryBuilder builder = new SearchPropertiesQueryBuilder();
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:86:33
         bool isSale = transaction.Is(Transaction.All) || transaction.Is(Transaction.Sale);
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
-        float sellingPriceMin = isSale ? request.MinPrice : 0;
+        float sellingPriceMin = (false?request.MinPrice :0);
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2

[Killed] Conditional (true) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:86:33
         bool isSale = transaction.Is(Transaction.All) || transaction.Is(Transaction.Sale);
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
-        float sellingPriceMin = isSale ? request.MinPrice : 0;
+        float sellingPriceMin = (true?request.MinPrice :0);
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Conditional (true) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:87:33
         bool isRent = transaction.Is(Transaction.All) || transaction.Is(Transaction.Rent);
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
-        float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
+        float sellingPriceMax = (true?request.MaxPrice :DefaultMaxPrice);
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:88:37
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
-        float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
+        float rentalTotalPriceMin = (false?request.MinPrice :0);
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Conditional (true) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:88:37
 
         float sellingPriceMin = isSale ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
-        float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
+        float rentalTotalPriceMin = (true?request.MinPrice :0);
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:89:37
         float sellingPriceMin = isSale ? request.MinPrice : 0;
         float sellingPriceMax = isSale && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         float rentalTotalPriceMin = isRent ? request.MinPrice : 0;
-        float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
+        float rentalTotalPriceMax = (false?request.MaxPrice :DefaultMaxPrice);
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchProperties

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:92:28
         float rentalTotalPriceMax = isRent && request.MaxPrice > 0 ? request.MaxPrice : DefaultMaxPrice;
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
-        byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
+        byte maxBedrooms = (false?request.MaxBedrooms :DefaultMaxRooms);
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:93:27
         
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
-        byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
+        byte minToilets = (false?request.MinToilets :(byte)0);
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:94:27
         byte minBedrooms = request.MinBedrooms > 0 ? request.MinBedrooms : (byte)0;
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
-        byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
+        byte maxToilets = (false?request.MaxToilets :DefaultMaxRooms);
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:95:27
         byte maxBedrooms = request.MaxBedrooms > 0 ? request.MaxBedrooms : DefaultMaxRooms;
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
-        byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
+        byte minGarages = (false?request.MinGarages :(byte)0);
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:96:27
         byte minToilets = request.MinToilets > 0 ? request.MinToilets : (byte)0;
         byte maxToilets = request.MaxToilets > 0 ? request.MaxToilets : DefaultMaxRooms;
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
-        byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
+        byte maxGarages = (false?request.MaxGarages :DefaultMaxRooms);
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:98:23
         byte minGarages = request.MinGarages > 0 ? request.MinGarages : (byte)0;
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
-        int minArea = request.MinArea > 0 ? request.MinArea : 0;
+        int minArea = (false?request.MinArea :0);
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:99:23
         byte maxGarages = request.MaxGarages > 0 ? request.MaxGarages : DefaultMaxRooms;
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
-        int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
+        int maxArea = (false?request.MaxArea :DefaultMaxArea);
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:100:28
         
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
-        int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
+        int minBuiltArea = (false?request.MinBuiltArea :0);
         int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent

[Killed] Conditional (false) mutation
Domains/Properties/EntryPoints/SearchPropertiesController.cs:101:28
         int minArea = request.MinArea > 0 ? request.MinArea : 0;
         int maxArea = request.MaxArea > 0 ? request.MaxArea : DefaultMaxArea;
         int minBuiltArea = request.MinBuiltArea > 0 ? request.MinBuiltArea : 0;
-        int maxBuiltArea = request.MaxBuiltArea > 0 ? request.MaxBuiltArea : DefaultMaxArea;
+        int maxBuiltArea = (false?request.MaxBuiltArea :DefaultMaxArea);
 
         List<string> districts = request.Districts?
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent2; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningPartialContent; IntegrationTest.EntryPoint.WebApi.Domains.Properties.EntryPoints.SearchPropertiesApiMethodTest.SuccessfulToSearchPropertiesReturningNoContent
