[Survived] Statement mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:27:70
 
         void ClusterConfigurator(ClusterBuilder builder)
         {
-            builder.Subscribe<CommandStartedEvent>(startedEvent => { Console.WriteLine($"{startedEvent.CommandName} - {startedEvent.Command.ToJson()}"); });
+            builder.Subscribe<CommandStartedEvent>(startedEvent => { ; });
         }
     }

[Survived] Statement mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:27:13
 
         void ClusterConfigurator(ClusterBuilder builder)
         {
-            builder.Subscribe<CommandStartedEvent>(startedEvent => { Console.WriteLine($"{startedEvent.CommandName} - {startedEvent.Command.ToJson()}"); });
+            ;
         }
     }
