[Killed] Block removal mutation
Domains/Properties/Providers/GetPropertyByUuidProvider.cs:17:5
     private readonly IRepository<PropertyEntity> _repository;
 
     public GetPropertyByUuidProvider(IRepository<PropertyEntity> repository)
-    {
-        _repository = repository;
-    }
+    {}
 
     public async Task<Core.Commons.Optional<Property>> ExecuteAsync(GetPropertyByUuidQuery query)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByUuidProviderTest.FailToGetPropertyByUuid; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByUuidProviderTest.SuccessfulToGetPropertyByUuid

[Killed] Block removal mutation
Domains/Properties/Providers/GetPropertyByUuidProvider.cs:22:5
     }
 
     public async Task<Core.Commons.Optional<Property>> ExecuteAsync(GetPropertyByUuidQuery query)
-    {
-        FilterDefinition<PropertyEntity> filterDefinition = GetFilterDefinition(query.Uuid);
-        Core.Commons.Optional<PropertyEntity> optional = await _repository.FindOneAsync(filterDefinition);
-        return optional.Map(PropertyMapper.Map);
-    }
+    {}
 
     private static FilterDefinition<PropertyEntity> GetFilterDefinition(string uuid)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByUuidProviderTest.SuccessfulToGetPropertyByUuid

[Killed] Block removal mutation
Domains/Properties/Providers/GetPropertyByUuidProvider.cs:29:5
     }
 
     private static FilterDefinition<PropertyEntity> GetFilterDefinition(string uuid)
-    {
-        return Builders<PropertyEntity>.Filter.Eq(document => document.Uuid, uuid);
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByUuidProviderTest.FailToGetPropertyByUuid; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByUuidProviderTest.SuccessfulToGetPropertyByUuid
