[Killed] Negate expression
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:23:13
         // We always add two more sorting criteria (ranking and updatedAt).
 
         // If the user has specified any sorting criteria:
-        if (arrayOfOrders.Any())
+        if (!(arrayOfOrders.Any()))
         {
             // The properties sponsorship will always be a tie-breaking criterion
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteriaWithDefaultSortingCriteria

[Killed] Negate expression
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:29:17
             // if there are multiple properties tied at previous levels of ordering.
             
             // Check if DefaultPrimarySortField is already in the list of orders.
-            if (orders.TrueForAll(order => order.Property != DefaultPrimarySortField))
+            if (!(orders.TrueForAll(order => order.Property != DefaultPrimarySortField)))
             {
                 orders.Add(new Order(Direction.Desc, DefaultPrimarySortField));
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteriaWithDefaultSortingCriteria

[Killed] Equality mutation
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:29:44
             // if there are multiple properties tied at previous levels of ordering.
             
             // Check if DefaultPrimarySortField is already in the list of orders.
-            if (orders.TrueForAll(order => order.Property != DefaultPrimarySortField))
+            if (orders.TrueForAll(order => order.Property == DefaultPrimarySortField))
             {
                 orders.Add(new Order(Direction.Desc, DefaultPrimarySortField));
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteriaWithDefaultSortingCriteria

[Killed] Statement mutation
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:31:17
             // Check if DefaultPrimarySortField is already in the list of orders.
             if (orders.TrueForAll(order => order.Property != DefaultPrimarySortField))
             {
-                orders.Add(new Order(Direction.Desc, DefaultPrimarySortField));
+                ;
             }
             
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteriaWithDefaultSortingCriteria

[Killed] Negate expression
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:35:17
             }
             
             // Check if DefaultSecondarySortField is already in the list of orders.
-            if (orders.TrueForAll(order => order.Property != DefaultSecondarySortField))
+            if (!(orders.TrueForAll(order => order.Property != DefaultSecondarySortField)))
             {
                 orders.Add(new Order(Direction.Desc, DefaultSecondarySortField));
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteriaWithDefaultSortingCriteria

[Killed] Equality mutation
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:35:44
             }
             
             // Check if DefaultSecondarySortField is already in the list of orders.
-            if (orders.TrueForAll(order => order.Property != DefaultSecondarySortField))
+            if (orders.TrueForAll(order => order.Property == DefaultSecondarySortField))
             {
                 orders.Add(new Order(Direction.Desc, DefaultSecondarySortField));
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria

[Killed] Statement mutation
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:37:17
             // Check if DefaultSecondarySortField is already in the list of orders.
             if (orders.TrueForAll(order => order.Property != DefaultSecondarySortField))
             {
-                orders.Add(new Order(Direction.Desc, DefaultSecondarySortField));
+                ;
             }
             
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnSortingCriteriaWhenTheUserHasSpecifiedAnySortingCriteria

[Killed] Statement mutation
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:44:9
         }
 
         // If the user has not specified any sorting criteria:
-        orders.Insert(0, new Order(Direction.Desc, DefaultSecondarySortField));
+        ;
         orders.Insert(0, new Order(Direction.Desc, DefaultPrimarySortField));
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnDefaultSortingCriteriaWhenTheUserHasNotSpecifiedAnySortingCriteria

[Killed] Statement mutation
Domains/Properties/Providers/PropertySortDefinitionHelper.cs:45:9
 
         // If the user has not specified any sorting criteria:
         orders.Insert(0, new Order(Direction.Desc, DefaultSecondarySortField));
-        orders.Insert(0, new Order(Direction.Desc, DefaultPrimarySortField));
+        ;
 
         return SortHelper.GetSortDefinitions<PropertyEntity>(orders);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.PropertySortDefinitionHelperTest.SuccessToReturnDefaultSortingCriteriaWhenTheUserHasNotSpecifiedAnySortingCriteria
