[Killed] Block removal mutation
Domains/Properties/Providers/RegisterPropertyProvider.cs:41:5
     }
 
     private async Task IncrementId(Entity entity)
-    {
-        FilterDefinition<PropertySequence> filter = Builders<PropertySequence>.Filter.Eq(sequence => sequence.SequenceName, KeyField);
-        ISequence sequence = await _propertySequenceRepository.GetSequenceAndUpdate(filter);
-        entity.Id = sequence.SequenceValue;
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.GetPropertyByUuidProviderTest.SuccessfulToGetPropertyByUuid; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
