[Killed] Block removal mutation
Domains/Properties/Providers/SearchPropertiesProvider.cs:28:5
     }
 
     public async Task<Page<Property>> ExecuteAsync(SearchPropertiesQuery query, PageRequest pageRequest)
-    {
-        FilterDefinition<PropertyEntity> filter = SearchPropertiesFilterBuilder.Build(query);
-        SortDefinition<PropertyEntity> sort = PropertySortDefinitionHelper.GetSortDefinitions(pageRequest.Sort.GetOrders());
-        Page<PropertyEntity> page = await _propertyRepository.FindAllAsync(filter, sort, pageRequest.PageNumber, pageRequest.PageSize);
-        List<Property> content = page.Content.Select(PropertyMapper.Map).ToList();
-
-        return new Page<Property>(content, page.Pageable);
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
