[Killed] Negate expression
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:26:30
     {
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
-        List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
+        List<string> types = !(query.Types.Contains(NoFilter) ) ? new List<string>() : query.Types;
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:27:9
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
         List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
-        FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
+        ;
 
         string status = query.Status.ToUpperInvariant() == NoFilter ? DefaultStatusFilter : query.Status;
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:29:25
         List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
-        string status = query.Status.ToUpperInvariant() == NoFilter ? DefaultStatusFilter : query.Status;
+        string status = query.Status.ToUpperInvariant() != NoFilter ? DefaultStatusFilter : query.Status;
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:30:9
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
         string status = query.Status.ToUpperInvariant() == NoFilter ? DefaultStatusFilter : query.Status;
-        FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
+        ;
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:34:9
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
 
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:35:9
         FilterHelper.AddInArrayFilter(filters, document => document.District, query.Location.Districts);
 
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:36:9
 
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:37:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:38:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
+        ;
 
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To, DefaultMaxRooms);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:40:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Area, query.Attributes.Area.From);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
 
-        AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To, DefaultMaxRooms);
+        ;
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To, DefaultMaxRooms);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:41:9
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.BuiltArea, query.Attributes.BuiltArea.From);
 
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To, DefaultMaxRooms);
-        AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To, DefaultMaxRooms);
+        ;
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.Area, query.Attributes.Area.To, DefaultMaxArea);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:42:9
 
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To, DefaultMaxRooms);
-        AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To, DefaultMaxRooms);
+        ;
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.Area, query.Attributes.Area.To, DefaultMaxArea);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To, DefaultMaxArea);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:43:9
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfBedrooms, query.Attributes.NumberOfBedrooms.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To, DefaultMaxRooms);
-        AddToFiltersIfLessOrThanDefaultValue(filters, document => document.Area, query.Attributes.Area.To, DefaultMaxArea);
+        ;
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To, DefaultMaxArea);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:44:9
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfToilets, query.Attributes.NumberOfToilets.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.NumberOfGarages, query.Attributes.NumberOfGarages.To, DefaultMaxRooms);
         AddToFiltersIfLessOrThanDefaultValue(filters, document => document.Area, query.Attributes.Area.To, DefaultMaxArea);
-        AddToFiltersIfLessOrThanDefaultValue(filters, document => document.BuiltArea, query.Attributes.BuiltArea.To, DefaultMaxArea);
+        ;
 
         switch (query.Advertise.Transaction.ToUpperInvariant())
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:49:17
         switch (query.Advertise.Transaction.ToUpperInvariant())
         {
             case RentTransaction:
-                FilterHelper.AddEqualsFilter(filters, document => document.Transaction, RentTransaction);
+                ;
                 filters.Add(Builders<PropertyEntity>.Filter.And(BuildRentFilterDefinitions(query)));
                 break;
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:50:17
         {
             case RentTransaction:
                 FilterHelper.AddEqualsFilter(filters, document => document.Transaction, RentTransaction);
-                filters.Add(Builders<PropertyEntity>.Filter.And(BuildRentFilterDefinitions(query)));
+                ;
                 break;
             case SaleTransaction:
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[NoCoverage] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:53:17
                 filters.Add(Builders<PropertyEntity>.Filter.And(BuildRentFilterDefinitions(query)));
                 break;
             case SaleTransaction:
-                FilterHelper.AddEqualsFilter(filters, document => document.Transaction, SaleTransaction);
+                ;
                 filters.Add(Builders<PropertyEntity>.Filter.And(BuildSaleFilterDefinitions(query)));
                 break;

[NoCoverage] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:54:17
                 break;
             case SaleTransaction:
                 FilterHelper.AddEqualsFilter(filters, document => document.Transaction, SaleTransaction);
-                filters.Add(Builders<PropertyEntity>.Filter.And(BuildSaleFilterDefinitions(query)));
+                ;
                 break;
             default:

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:58:17
                 break;
             default:
             {
-                AddPricesFilters(query, filters);
+                ;
                 break;
             }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:63:9
             }
         }
 
-        FilterHelper.AddEqualsFilter(filters, document => document.Status, status);
+        ;
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Ranking, query.Ranking);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:64:9
         }
 
         FilterHelper.AddEqualsFilter(filters, document => document.Status, status);
-        FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Ranking, query.Ranking);
+        ;
 
         return filters.Count == 0 ? Builders<PropertyEntity>.Filter.Empty : Builders<PropertyEntity>.Filter.And(filters);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:74:9
         List<FilterDefinition<PropertyEntity>> rentFilterDefinitions = BuildRentFilterDefinitions(query);
         
         IEnumerable<FilterDefinition<PropertyEntity>> saleFilterDefinitions = BuildSaleFilterDefinitions(query);
-        rentFilterDefinitions.Add(Builders<PropertyEntity>.Filter.Or(saleFilterDefinitions));
+        ;
         filters.Add(Builders<PropertyEntity>.Filter.And(rentFilterDefinitions));
     }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:75:9
         
         IEnumerable<FilterDefinition<PropertyEntity>> saleFilterDefinitions = BuildSaleFilterDefinitions(query);
         rentFilterDefinitions.Add(Builders<PropertyEntity>.Filter.Or(saleFilterDefinitions));
-        filters.Add(Builders<PropertyEntity>.Filter.And(rentFilterDefinitions));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:82:9
     {
         List<FilterDefinition<PropertyEntity>> saleFilterDefinitions = new List<FilterDefinition<PropertyEntity>>();
         
-        FilterHelper.AddGreaterOrEqualFilter(saleFilterDefinitions, document => document.SellingPrice, query.Prices.SellingPrice.From);
+        ;
         AddToFiltersIfLessOrThanDefaultValue(saleFilterDefinitions, document => document.SellingPrice, query.Prices.SellingPrice.To, DefaultMaxPrice);
         

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:83:9
         List<FilterDefinition<PropertyEntity>> saleFilterDefinitions = new List<FilterDefinition<PropertyEntity>>();
         
         FilterHelper.AddGreaterOrEqualFilter(saleFilterDefinitions, document => document.SellingPrice, query.Prices.SellingPrice.From);
-        AddToFiltersIfLessOrThanDefaultValue(saleFilterDefinitions, document => document.SellingPrice, query.Prices.SellingPrice.To, DefaultMaxPrice);
+        ;
         
         return saleFilterDefinitions;
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:92:9
     {
         List<FilterDefinition<PropertyEntity>> rentFilterDefinitions = new List<FilterDefinition<PropertyEntity>>();
         
-        FilterHelper.AddGreaterOrEqualFilter(rentFilterDefinitions, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
+        ;
         AddToFiltersIfLessOrThanDefaultValue(rentFilterDefinitions, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To, DefaultMaxPrice);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:93:9
         List<FilterDefinition<PropertyEntity>> rentFilterDefinitions = new List<FilterDefinition<PropertyEntity>>();
         
         FilterHelper.AddGreaterOrEqualFilter(rentFilterDefinitions, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.From);
-        AddToFiltersIfLessOrThanDefaultValue(rentFilterDefinitions, document => document.RentalTotalPrice, query.Prices.RentalTotalPrice.To, DefaultMaxPrice);
+        ;
 
         return rentFilterDefinitions;
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:100:14
     
     private static void AddToFiltersIfLessOrThanDefaultValue<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value, float defaultValue)
     {
-        if ( value <= 0 || value >= defaultValue)
+        if ( value < 0 || value >= defaultValue)
         {
             FilterHelper.AddLessOrEqualFilter(filterDefinitions, expression, defaultValue);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Equality mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:100:14
     
     private static void AddToFiltersIfLessOrThanDefaultValue<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value, float defaultValue)
     {
-        if ( value <= 0 || value >= defaultValue)
+        if ( value > 0 || value >= defaultValue)
         {
             FilterHelper.AddLessOrEqualFilter(filterDefinitions, expression, defaultValue);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:102:13
     {
         if ( value <= 0 || value >= defaultValue)
         {
-            FilterHelper.AddLessOrEqualFilter(filterDefinitions, expression, defaultValue);
+            ;
             return;
         }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Survived] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:103:13
         if ( value <= 0 || value >= defaultValue)
         {
             FilterHelper.AddLessOrEqualFilter(filterDefinitions, expression, defaultValue);
-            return;
+            ;
         }
 

[Killed] Statement mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:106:9
             return;
         }
 
-        FilterHelper.AddLessOrEqualFilter(filterDefinitions, expression, value);
+        ;
     } 
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant
