[Killed] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:12:5
     private readonly Lazy<IMongoClient> _client;
 
     public ConnectionFactory(string connectionString)
-    {
-        _connectionString = connectionString;
-        _client = new Lazy<IMongoClient>(CreateClient);
-    }
+    {}
 
     public IMongoClient GetClient()
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:18:5
     }
 
     public IMongoClient GetClient()
-    {
-        return _client.Value;
-    }
+    {}
 
     public IMongoDatabase GetDatabase(string databaseName)
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:23:5
     }
 
     public IMongoDatabase GetDatabase(string databaseName)
-    {
-        return GetClient().GetDatabase(databaseName);
-    }
+    {}
 
     private IMongoClient CreateClient()
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties

[Killed] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:28:5
     }
 
     private IMongoClient CreateClient()
-    {
-        MongoClientSettings settings = MongoClientSettings.FromUrl(new MongoUrl(_connectionString));
-
-        return new MongoClient(settings);
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
