[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:53:13
     public static void AddLessOrEqualFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value)
     {
         const float epsilon = 0.0001f; 
-        if (value < epsilon) return;
+        if (value <= epsilon) return;
         filterDefinitions.Add(Builders<T>.Filter.Lte(expression, value));
     }
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
