[NoCoverage] String mutation
Domains/Properties/Mapper/PropertyMapper.cs:13:62
     public static Property Map(this PropertyEntity propertyEntity)
     {
         PropertyType type = PropertyType.GetByName(propertyEntity.Type)
-            .OrElseThrow(() => new InvalidOperationException($"Property '{propertyEntity.Id}' has an unknown type '{propertyEntity.Type}'"));
+            .OrElseThrow(() => new InvalidOperationException($""));
 
         Transaction transaction = Transaction.GetByName(propertyEntity.Transaction)

[NoCoverage] String mutation
Domains/Properties/Mapper/PropertyMapper.cs:16:62
             .OrElseThrow(() => new InvalidOperationException($"Property '{propertyEntity.Id}' has an unknown type '{propertyEntity.Type}'"));
 
         Transaction transaction = Transaction.GetByName(propertyEntity.Transaction)
-            .OrElseThrow(() => new InvalidOperationException($"Property '{propertyEntity.Id}' has an unknown transaction '{propertyEntity.Transaction}'"));
+            .OrElseThrow(() => new InvalidOperationException($""));
 
         PropertyAdvertise advertise = new PropertyAdvertise

[Killed] Object initializer mutation
Domains/Properties/Mapper/PropertyMapper.cs:30:41
             HdImages = propertyEntity.HdImages.ToList()
         };
 
-        PropertyAttributes attributes = new PropertyAttributes
-        {
-            NumberOfBedrooms = (byte) propertyEntity.NumberOfBedrooms,
-            NumberOfToilets = (byte) propertyEntity.NumberOfToilets,
-            NumberOfGarages = (byte) propertyEntity.NumberOfGarages,
-            Area = propertyEntity.Area,
-            BuiltArea = propertyEntity.BuiltArea
-        };
+        PropertyAttributes attributes = new PropertyAttributes
+{};
 
         PropertyLocation location = new PropertyLocation
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchProperties
