[Killed] Conditional (true) mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:26:30
     {
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
-        List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
+        List<string> types = (true?new List<string>() :query.Types);
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant

[Killed] Conditional (false) mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:26:30
     {
         List<FilterDefinition<PropertyEntity>> filters = new List<FilterDefinition<PropertyEntity>>();
 
-        List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
+        List<string> types = (false?new List<string>() :query.Types);
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Conditional (true) mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:29:25
         List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
-        string status = query.Status.ToUpperInvariant() == NoFilter ? DefaultStatusFilter : query.Status;
+        string status = (true?DefaultStatusFilter :query.Status);
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.SuccessfulToSearchPropertiesWithNoSort

[Killed] Conditional (false) mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:29:25
         List<string> types = query.Types.Contains(NoFilter) ? new List<string>() : query.Types;
         FilterHelper.AddInArrayFilter(filters, document => document.Type, types);
 
-        string status = query.Status.ToUpperInvariant() == NoFilter ? DefaultStatusFilter : query.Status;
+        string status = (false?DefaultStatusFilter :query.Status);
         FilterHelper.AddEqualsFilter(filters, document => document.State, query.Location.State);
         FilterHelper.AddEqualsFilter(filters, document => document.City, query.Location.City);
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant

[Killed] Conditional (true) mutation
Domains/Properties/Repository/SearchPropertiesFilterBuilder.cs:66:16
         FilterHelper.AddEqualsFilter(filters, document => document.Status, status);
         FilterHelper.AddGreaterOrEqualFilter(filters, document => document.Ranking, query.Ranking);
 
-        return filters.Count == 0 ? Builders<PropertyEntity>.Filter.Empty : Builders<PropertyEntity>.Filter.And(filters);
+        return (true?Builders<PropertyEntity>.Filter.Empty :Builders<PropertyEntity>.Filter.And(filters));
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildFilterDefinitionWhenValuesAreRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Repository.SearchPropertiesFilterBuilderTest.SuccessToBuildASingleStatusFilterDefinitionWhenOtherValuesAreNotRelevant; IntegrationTest.Infra.MongoDB.Domains.Properties.Providers.SearchPropertiesProviderTest.FailToSearchPropertiesWhenThereIsNoProperties
